{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"special":true,"content":"<pad>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"<unk>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"<bos>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"<eos>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":null,"pre_tokenizer":{"type":"ByteLevel","add_prefix_space":false,"trim_offsets":true},"post_processor":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":false},"decoder":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":true},"model":{"type":"BPE","dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"vocab":{"<pad>":0,"<unk>":1,"<bos>":2,"<eos>":3,"!":4,"\"":5,"#":6,"$":7,"%":8,"&":9,"'":10,"(":11,")":12,"*":13,"+":14,",":15,"-":16,".":17,"/":18,"0":19,"1":20,"2":21,"3":22,"4":23,"5":24,"6":25,"7":26,"8":27,"9":28,":":29,";":30,"<":31,"=":32,">":33,"?":34,"@":35,"A":36,"B":37,"C":38,"D":39,"E":40,"F":41,"G":42,"H":43,"I":44,"J":45,"K":46,"L":47,"M":48,"N":49,"O":50,"P":51,"Q":52,"R":53,"S":54,"T":55,"U":56,"V":57,"W":58,"X":59,"Y":60,"Z":61,"[":62,"\\":63,"]":64,"^":65,"_":66,"`":67,"a":68,"b":69,"c":70,"d":71,"e":72,"f":73,"g":74,"h":75,"i":76,"j":77,"k":78,"l":79,"m":80,"n":81,"o":82,"p":83,"q":84,"r":85,"s":86,"t":87,"u":88,"v":89,"w":90,"x":91,"y":92,"z":93,"{":94,"|":95,"}":96,"~":97,"¡":98,"¢":99,"£":100,"¤":101,"¥":102,"¦":103,"§":104,"¨":105,"©":106,"ª":107,"«":108,"¬":109,"®":110,"¯":111,"°":112,"±":113,"²":114,"³":115,"´":116,"µ":117,"¶":118,"·":119,"¸":120,"¹":121,"º":122,"»":123,"¼":124,"½":125,"¾":126,"¿":127,"À":128,"Á":129,"Â":130,"Ã":131,"Ä":132,"Å":133,"Æ":134,"Ç":135,"È":136,"É":137,"Ê":138,"Ë":139,"Ì":140,"Í":141,"Î":142,"Ï":143,"Ð":144,"Ñ":145,"Ò":146,"Ó":147,"Ô":148,"Õ":149,"Ö":150,"×":151,"Ø":152,"Ù":153,"Ú":154,"Û":155,"Ü":156,"Ý":157,"Þ":158,"ß":159,"à":160,"á":161,"â":162,"ã":163,"ä":164,"å":165,"æ":166,"ç":167,"è":168,"é":169,"ê":170,"ë":171,"ì":172,"í":173,"î":174,"ï":175,"ð":176,"ñ":177,"ò":178,"ó":179,"ô":180,"õ":181,"ö":182,"÷":183,"ø":184,"ù":185,"ú":186,"û":187,"ü":188,"ý":189,"þ":190,"ÿ":191,"Ā":192,"ā":193,"Ă":194,"ă":195,"Ą":196,"ą":197,"Ć":198,"ć":199,"Ĉ":200,"ĉ":201,"Ċ":202,"ċ":203,"Č":204,"č":205,"Ď":206,"ď":207,"Đ":208,"đ":209,"Ē":210,"ē":211,"Ĕ":212,"ĕ":213,"Ė":214,"ė":215,"Ę":216,"ę":217,"Ě":218,"ě":219,"Ĝ":220,"ĝ":221,"Ğ":222,"ğ":223,"Ġ":224,"ġ":225,"Ģ":226,"ģ":227,"Ĥ":228,"ĥ":229,"Ħ":230,"ħ":231,"Ĩ":232,"ĩ":233,"Ī":234,"ī":235,"Ĭ":236,"ĭ":237,"Į":238,"į":239,"İ":240,"ı":241,"Ĳ":242,"ĳ":243,"Ĵ":244,"ĵ":245,"Ķ":246,"ķ":247,"ĸ":248,"Ĺ":249,"ĺ":250,"Ļ":251,"ļ":252,"Ľ":253,"ľ":254,"Ŀ":255,"ŀ":256,"Ł":257,"ł":258,"Ń":259,"Ġt":260,"he":261,"in":262,"Ġa":263,"Ġthe":264,"er":265,"--":266,"Ġo":267,"re":268,"Ġs":269,"le":270,"ĠĠ":271,"on":272,"Ġc":273,"ut":274,"is":275,"at":276,"es":277,"Ġw":278,"Ġof":279,"Ġ1":280,"it":281,"Ġn":282,"Ġf":283,"en":284,"an":285,"Ġan":286,"Ġin":287,"Ġp":288,"Ġb":289,"ing":290,"ou":291,"or":292,"um":293,"put":294,"Ġ=":295,"ll":296,"ar":297,"Ġis":298,"am":299,"Ġm":300,"as":301,"ed":302,"Ġto":303,"Ġd":304,"ion":305,"Ġand":306,"Ġe":307,"ĠĠĠĠ":308,"al":309,"``":310,"00":311,"Ġ$":312,"Ġ2":313,"st":314,"Âł":315,"ac":316,"Ġth":317,"----":318,"ple":319,"Ġre":320,"Ġ[":321,"ot":322,"om":323,"ay":324,"Ġl":325,"Ex":326,"Ġnum":327,"ers":328,"et":329,"-----":330,"Ġg":331,"In":332,"Ġ3":333,"ample":334,"The":335,"ur":336,"ts":337,"ve":338,"Ġ(":339,"Ġh":340,"ic":341,"Ġ<":342,"Ġst":343,"utput":344,"Ġon":345,"Ġnumb":346,"Ġbe":347,"ow":348,"im":349,"Ġ-":350,"th":351,"ain":352,"Input":353,"Ġ<=":354,"te":355,"Output":356,"ation":357,"Ġcon":358,"Ġ\"":359,"ct":360,"Example":361,"qu":362,"Ġare":363,"```":364,"urn":365,"],":366,"Ġthat":367,"Ġy":368,"Ġ`":369,"Ġ4":370,"Ġar":371,"se":372,"if":373,"Ġnumber":374,"ĠA":375,"ir":376,"pl":377,"ig":378,"\",":379,"od":380,"ith":381,"teg":382,"est":383,"Ġr":384,"Ġarr":385,"iv":386,"**":387,"ce":388,"Ġinteg":389,"Ġ\\":390,"Ġ0":391,"Ġle":392,"Ġyou":393,"Ġpo":394,"ld":395,"ent":396,"Ġ5":397,"id":398,"ach":399,"ill":400,"Ġcan":401,"ly":402,"ĠThe":403,"turn":404,"Ġv":405,"ĠĊ":406,"ng":407,"Ġreturn":408,"Ġ10":409,"Ġor":410,"ring":411,"Ġwith":412,"ĠĠĠĠĠĠĠĠ":413,"Ġfor":414,"Ġit":415,"un":416,"Ġwill":417,"Ġse":418,"tain":419,"Ġpr":420,"ngth":421,"ase":422,"ter":423,"Ġk":424,"Ġsu":425,"iven":426,"Ġex":427,"ine":428,"plan":429,"ht":430,"ue":431,"planation":432,"Explanation":433,"Ġeach":434,"ist":435,"Ġcontain":436,"Ġas":437,"ak":438,"Ġstring":439,"ive":440,"ĠN":441,"10":442,"ble":443,"ul":444,"Ġfr":445,"Ġarray":446,"Ġne":447,"irst":448,"You":449,"ĠC":450,"her":451,"Ġ+":452,"ol":453,"Ġch":454,"ĠS":455,"Ġ*":456,"Ġsh":457,"ĠT":458,"Ġâ":459,"ÂłĊ":460,"Ġif":461,"Ġone":462,"Ġtest":463,"Ġval":464,"ss":465,"Ġinteger":466,"ould":467,"Ġ6":468,"Ġall":469,"ave":470,"..":471,"\",\"":472,"Ġfirst":473,"Ġwh":474,"Ġat":475,"ad":476,"Ġline":477,"Ġfrom":478,"wo":479,"For":480,"ame":481,"Ġnot":482,"Ġ'":483,"Ġby":484,"ore":485,"ver":486,"//":487,"length":488,"Ġhe":489,"pe":490,"ction":491,"ī¤":492,"us":493,"Ġwhe":494,"nt":495,"Ġtwo":496,"str":497,"],[":498,"all":499,"ge":500,").":501,"ch":502,"Ġhave":503,"Ġtr":504,"Ġintegers":505,"Ġ7":506,"Ġwe":507,"Ġthis":508,"ord":509,"oll":510,"11":511,"ode":512,"Ġpro":513,"__":514,"++":515,"pt":516,"Ġgiven":517,"Ġcontains":518,"ĠB":519,"0000":520,"Ġâī¤":521,"Ġsub":522,"Ġ->":523,"ight":524,"oo":525,"Ġhas":526,"ence":527,"Ġ**":528,"Ġj":529,"ard":530,"imum":531,"ap":532,"ind":533,"Ġonly":534,"Ġcase":535,"ab":536,"Ġshould":537,"ĠI":538,"ond":539,"ust":540,"strain":541,"##":542,"res":543,"ate":544,"ww":545,"com":546,"Ġi":547,"straints":548,"art":549,"ax":550,"sit":551,"ents":552,"ake":553,"act":554,"ollow":555,"ask":556,"el":557,"'s":558,"end":559,"Ġgr":560,"leq":561,"ps":562,"Ġal":563,"Ġfollow":564,"ri":565,"Ġpoin":566,"Ġnums":567,"and":568,"ich":569,"per":570,"ck":571,"Ġany":572,"Con":573,"ĠĠĠ":574,"$.":575,"ays":576,"ible":577,"000":578,"Ġso":579,"Ġthere":580,"),":581,"ex":582,"Ġde":583,"Ġwhich":584,"unction":585,"Constraints":586,"_**":587,"ies":588,"ove":589,"ata":590,"Ġpl":591,"Ġnumbers":592,"lem":593,"iz":594,"Ġposit":595,"Ġtim":596,"Ġsum":597,"der":598,"ice":599,"ote":600,"arr":601,"Ġ9":602,"Ġ==":603,"Ġfunction":604,"Ġco":605,"ĠE":606,"quence":607,"Ġ|":608,"Ġ8":609,"ome":610,"ars":611,"ases":612,"ther":613,"Ġmin":614,"ult":615,"ang":616,"Ġ**_":617,"Ġinput":618,"Ġelem":619,"$,":620,"Ġexample":621,"em":622,"Ġmax":623,"Given":624,"Ġpoints":625,"ast":626,"Ġlength":627,"Ġx":628,"ssible":629,"Ġcom":630,"Ġu":631,"ob":632,"',":633,"Ġun":634,"we":635,"Ġlet":636,"Ġsing":637,"Ġvalue":638,"lo":639,"].":640,"cond":641,"ree":642,"ĠM":643,"ĠP":644,"are":645,"ace":646,"int":647,"://":648,"Ġbo":649,"sw":650,"Ġsingle":651,"ated":652,"Ġword":653,"ations":654,"ĠR":655,"code":656,"ĠW":657,"ĠH":658,"ity":659,"ack":660,"eturn":661,"Ġsecond":662,"ount":663,"ĠK":664,"il":665,"its":666,"htt":667,"Ġper":668,"Ġthan":669,"ub":670,"12":671,"Ġneed":672,"ite":673,"Ġdo":674,"Ġcases":675,"ally":676,"fter":677,"Ġansw":678,"iff":679,"for":680,"ik":681,"ell":682,"](":683,"ates":684,"Ġorder":685,"Ġ#":686,"Ġpossible":687,"Ġchar":688,"ĠYou":689,"ower":690,"ile":691,"Ġind":692,"ĠL":693,"get":694,"Ġcons":695,"ong":696,"hef":697,");":698,"ĠIf":699,"Ġno":700,"Note":701,"_{":702,"Ġother":703,"Ġqu":704,"Ġthen":705,"ĠF":706,"nd":707,"Ġres":708,"ces":709,"ne":710,":-----":711,"Ġyour":712,"Ġsp":713,"Ġdiff":714,"Ġanswer":715,"Ġequ":716,"Ġ//":717,"Ġget":718,"our":719,"ag":720,"ters":721,"Ġab":722,"ish":723,"Ġrem":724,"case":725,"alse":726,"++++":727,"to":728,"Ġsequence":729,"...":730,"Ġmaximum":731,"ery":732,"Ġsuch":733,"Return":734,"Ġform":735,"Ġbet":736,"Ġlist":737,"Ġ[\"":738,"Ġgo":739,"one":740,"Ġdist":741,"urre":742,"po":743,"out":744,"Ġwhere":745,"ween":746,"Ġ```":747,"Ġsame":748,"ize":749,"Ġ100":750,"Ġsome":751,"Ġstart":752,"www":753,"Ġdig":754,"ions":755,"'t":756,"Ġus":757,"wars":758,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":759,"dd":760,"ost":761,"av":762,"`.":763,"ull":764,"Ġfollowing":765,"]]":766,"ustom":767,"~~":768,"Ġ[[":769,"ire":770,"ĠD":771,"py":772,"codewars":773,"ĠFor":774,"ort":775,"Ġequal":776,"heck":777,"ft":778,"form":779,"umb":780,"Ġbetween":781,"ists":782,"Ġoutput":783,"Ġem":784,"ie":785,"Ġtime":786,"Ġletters":787,"Ġcustom":788,"ass":789,"ues":790,"Ġplay":791,"Ġoper":792,"ment":793,"ide":794,"ov":795,"Ġminimum":796,"Ġelements":797,"ial":798,"urrent":799,"Ġ,":800,"ĠIn":801,"Ġthem":802,"not":803,"ip":804,"fit":805,"Ġrep":806,"ant":807,"cri":808,"Ġthey":809,"20":810,"ĠInput":811,"Ġfind":812,"Ġboard":813,"\"]":814,"If":815,"ound":816,"Ġreturns":817,"Ġden":818,"Ġprofit":819,",-":820,"ary":821,"the":822,"Ġhis":823,"thon":824,"pty":825,"Ġvalid":826,"Ġmore":827,"ca":828,"Ġ--":829,"so":830,"Ġcol":831,"Ġup":832,"Ġam":833,"Ġdiffer":834,"Ġ>":835,"xt":836,"cre":837,"resent":838,"Ġmake":839,"Ġindex":840,"Sample":841,"Ġrot":842,"tal":843,"very":844,"Ġpositive":845,"age":846,"ĠO":847,"ud":848,"()":849,"Ġday":850,"`,":851,"Ġbut":852,"ance":853,"gr":854,"oth":855,"uct":856,"Ġ12":857,"Ġ:":858,"Ġcustomers":859,"par":860,"ans":861,"cl":862,"cc":863,"Ġmay":864,"ro":865,"alle":866,"Ġlo":867,"ating":868,"ep":869,"Ġprint":870,"ath":871,"Ġsc":872,"ick":873,"Ġvalues":874,"Ġkn":875,"Ġgrou":876,"ative":877,"inal":878,"Ġnew":879,"99":880,"Ġ20":881,"Ġtrue":882,"ange":883,"ins":884,"Ġtotal":885,"Ġfalse":886,"rite":887,"air":888,"ĠChef":889,"Ġwheel":890,"Ġdenot":891,"Ġwa":892,"les":893,"Ġend":894,"Ġcell":895,"Ġmat":896,"Ġits":897,"There":898,"Ġright":899,"ĠOutput":900,"eries":901,"Ġlower":902,"âĢ":903,"python":904,"Ġman":905,"use":906,"own":907,"Ġafter":908,"Ġsqu":909,"akes":910,"acters":911,"___":912,"ven":913,"Ġdiv":914,"Ġleft":915,"ines":916,"val":917,"ous":918,"ime":919,"ect":920,"Ġnon":921,"Ġ-->":922,"ise":923,"Ġinto":924,"kata":925,"Ġposition":926,"olut":927,"--------":928,"Ġap":929,"Ġdigits":930,"task":931,"Ġspace":932,"Ġdes":933,"Ġ...":934,"ĠĠĊ":935,"Ġmove":936,"https":937,"Ġwait":938,"able":939,"Ġ1000":940,"Ġcor":941,"Ġob":942,"ook":943,"cause":944,"('":945,"oy":946,"Ġed":947,"Ġtask":948,"ey":949,"Ġgame":950,"cript":951,"string":952,"Check":953,"tr":954,"ince":955,"Ġsize":956,"Ġwords":957,"arget":958,"lice":959,"Ġsubse":960,"Ġevery":961,"Examples":962,"ĠThere":963,"ubtask":964,"Ġcharacters":965,"Ġstrings":966,"Ġpre":967,"ream":968,"100":969,"ots":970,"Ġlast":971,"Ġ=>":972,"array":973,"Ġmust":974,"gative":975,"http":976,"aph":977,"Checker":978,"Ġtimes":979,"Ġresult":980,"ways":981,"Ġelement":982,"Ġnext":983,"(\"":984,"==":985,"ype":986,"Ġamount":987,"ĠEach":988,"Ġtheir":989,"ure":990,"15":991,"Ġtarget":992,"Ġrepresent":993,"Ġwor":994,"ĠĠĠĠĠ":995,"Ġdoes":996,"parated":997,"Ġout":998,"ĠĠĠĠĠĠĠĠĠ":999,"reamChecker":1000,"ants":1001,"Ġalways":1002,"Ġbecause":1003,"ĠX":1004,"oose":1005,"his":1006,"57":1007,"ĠâĢ":1008,"Ġme":1009,"):":1010,"Ġcannot":1011,"ulti":1012,"igh":1013,"blem":1014,"Ġpile":1015,"Ġpair":1016,"ĠCurrent":1017,"Ġthree":1018,"wise":1019,"Ġrotates":1020,"eth":1021,"Ġ.":1022,"ike":1023,"ero":1024,"Ġpart":1025,"ee":1026,"Ġboth":1027,"ff":1028,"Ġempty":1029,"ater":1030,"umber":1031,"\".":1032,"ition":1033,"fore":1034,"Ġdifferent":1035,"Ġtree":1036,"Your":1037,"Ġlong":1038,"cd":1039,"Ġz":1040,"Ġcontaining":1041,"acter":1042,"Ġlines":1043,"Ġexact":1044,"null":1045,"ets":1046,"Ġlar":1047,"13":1048,"Ġwas":1049,"Ġ15":1050,"Ġsm":1051,"Ġdenoting":1052,"Ġadd":1053,"Ġtake":1054,"gh":1055,"Ġro":1056,"Ġgre":1057,"Ġpe":1058,"++++++++":1059,"Ġcost":1060,"Ġlowercase":1061,"ges":1062,"Ġspe":1063,"Ġwho":1064,"Ġcharacter":1065,"Ġleast":1066,"ext":1067,"ors":1068,"ĠG":1069,"Ġ11":1070,"Ġalso":1071,"45":1072,"Ġinit":1073,"Ġdec":1074,"oduct":1075,"ix":1076,"Ġrow":1077,"Ġproblem":1078,"([":1079,"Ġdivis":1080,"Subtask":1081,"We":1082,"Ġthese":1083,"Ġ{":1084,"ethod":1085,"ning":1086,"Ġim":1087,"Ġfollows":1088,"Ġsquare":1089,"Ġexactly":1090,"erm":1091,"Ġkey":1092,"inct":1093,"Ġen":1094,"Ġmost":1095,"][":1096,"Ġwhen":1097,"ider":1098,"Ġway":1099,"fin":1100,"ices":1101,"},":1102,"Ġcl":1103,"aa":1104,"ild":1105,"Ġmulti":1106,"cted":1107,"Ġ($":1108,"ĠJ":1109,"32":1110,"ople":1111,"Ġmod":1112,"imal":1113,"Ġscore":1114,"Ġtakes":1115,"~~~":1116,"Ġknow":1117,"Ġgu":1118,"\")":1119,"ign":1120,"query":1121,"ĠWe":1122,"ĠIt":1123,"Ġ16":1124,"old":1125,"cess":1126,"Ġhow":1127,"ough":1128,"Ġwould":1129,"Ġsubsequence":1130,"sum":1131,"tern":1132,"Ġchoose":1133,"with":1134,"Ġ13":1135,"Ġfour":1136,"Ġpass":1137,"Ġcoins":1138,"Ġte":1139,"Ġrequ":1140,"lish":1141,"Ġstr":1142,"Ġ==>":1143,"Ġconne":1144,"Ġwants":1145,"ph":1146,"low":1147,"Ġdistinct":1148,"uel":1149,"edi":1150,"ĠBob":1151,"Ġgraph":1152,"iqu":1153,"Ġ10000":1154,"16":1155,"Ġover":1156,"Ġpeople":1157,"erson":1158,"Ġorig":1159,"ĠSt":1160,"ĠAlice":1161,"Ġmany":1162,"inary":1163,"cul":1164,"Ġlike":1165,"list":1166,"23":1167,"50":1168,"18":1169,"gum":1170,"$-":1171,"');":1172,"Ġname":1173,"Ġpath":1174,"Ġzero":1175,"Ġkata":1176,"Ġpoint":1177,"Ġcity":1178,"Ġperm":1179,"Ġuse":1180,"streamChecker":1181,"Ġinter":1182,"Ġcomp":1183,"op":1184,"ict":1185,"Ġplayer":1186,"ctang":1187,"Ġsort":1188,"oves":1189,"Ġtri":1190,"ject":1191,"Ġbu":1192,"1111":1193,"ique":1194,"])":1195,"ĠĠĠĠĠĠ":1196,"clud":1197,"Ġargum":1198,"Ġloc":1199,"hes":1200,"Ġgroup":1201,"14":1202,"Ġmethod":1203,"Ġset":1204,"nglish":1205,"ere":1206,"Ġwork":1207,"Ġgrid":1208,"ird":1209,"ither":1210,"<=":1211,"Ġjum":1212,"itt":1213,"Ġbecom":1214,"Ġ`[":1215,"Ġpermut":1216,"Ġconsist":1217,"Ġdis":1218,"ĠAll":1219,"]`":1220,"ĠEnglish":1221,"ress":1222,"Ġoperations":1223,"Ġletter":1224,"de":1225,"etic":1226,"Ġabove":1227,"Ġeven":1228,"Ġ`\"":1229,"ĠĠĠĠĠĠĠ":1230,"Ġwant":1231,"Ġdistance":1232,"Ġcount":1233,"ator":1234,"Pr":1235,"Ġsubstring":1236,"Ġbinary":1237,"Ġperform":1238,"aces":1239,"aying":1240,"Ġ$(":1241,"Ġ/":1242,"umbers":1243,"Ġcont":1244,"Ġlongest":1245,"Ġnode":1246,"Ġfin":1247,"Ġstep":1248,"ry":1249,"Time":1250,"Ġperson":1251,"ert":1252,"Ġocc":1253,"aran":1254,"All":1255,"ash":1256,"arante":1257,"Ġsim":1258,"ĠV":1259,"Ġwin":1260,"Ġunique":1261,"It":1262,"Ġconsider":1263,"ests":1264,"otes":1265,"Ġwr":1266,"Ġcond":1267,"Ġfuel":1268,"Ġshe":1269,"ĠHe":1270,"Ġguarante":1271,"odes":1272,"Ġedges":1273,"Ġsubarray":1274,"ctions":1275,"alcul":1276,"ided":1277,"ied":1278,"reate":1279,"Ġpar":1280,"ĠThen":1281,"25":1282,"Ġused":1283,"rr":1284,"Ġoperation":1285,"Ġremove":1286,"col":1287,"Each":1288,"arrays":1289,"ical":1290,"ade":1291,"ploy":1292,"Ġguaranteed":1293,"Ġremain":1294,"quen":1295,"ĠâĢĶ":1296,"Ġinform":1297,"allest":1298,"Ġthird":1299,"ired":1300,"Ġcho":1301,"Ġarrive":1302,"Ġoriginal":1303,"33":1304,"Ġconsists":1305,"wik":1306,"Ġ[#":1307,"Ġemploy":1308,"Ġeither":1309,"Ġturn":1310,"Ġac":1311,"vers":1312,"St":1313,"iend":1314,"Ġfriend":1315,"ordin":1316,"\"],":1317,"Ġjob":1318,"Ġbefore":1319,"ĠSo":1320,"ĠExamples":1321,"Ġgroups":1322,"Ġye":1323,"other":1324,"ink":1325,"ithm":1326,"ives":1327,"\"`":1328,"Ġside":1329,"Ġhim":1330,"Ġteam":1331,"abc":1332,"###":1333,"$)":1334,"ĠTask":1335,"Ġ50":1336,"sh":1337,"Ġthr":1338,"cription":1339,"Ġminut":1340,"solut":1341,"separated":1342,"30":1343,"up":1344,"ess":1345,"Ġexce":1346,"Ġdigit":1347,"66":1348,"10000":1349,"ner":1350,"Ġwrite":1351,"Ġcand":1352,"Ġpower":1353,"Ġdays":1354,"âī¤":1355,"ib":1356,"cut":1357,"lease":1358,"Ġround":1359,"eps":1360,"Ġsee":1361,"Ġbox":1362,"Ġdire":1363,"->":1364,"ats":1365,"ulo":1366,"Ġless":1367,"lock":1368,"Ġexists":1369,"28":1370,"Write":1371,"Ġid":1372,"40":1373,"rom":1374,"Ġrectang":1375,"Ġmultiple":1376,"gram":1377,"Ġcurrent":1378,")$":1379,"atis":1380,"Ġ18":1381,"!!":1382,"---":1383,"Ġcomm":1384,"pect":1385,"Ġsolut":1386,"atisf":1387,"}$":1388,"Ġtrans":1389,"Ġonce":1390,"of":1391,"ular":1392,"Ġcard":1393,"uck":1394,"Ġcode":1395,"Ġpermutation":1396,"Ġball":1397,"Ġhel":1398,"ldots":1399,"Ġsmallest":1400,"24":1401,"Ġgood":1402,"ĠU":1403,"hed":1404,"plic":1405,"Ġbus":1406,"77":1407,"Ġdet":1408,"Ġstarting":1409,"Ġ...,":1410,"Ġjust":1411,"Ġsatisf":1412,"Ġmodulo":1413,"rect":1414,"ood":1415,"pond":1416,"Ġproduct":1417,"ci":1418,"Ġinitial":1419,"Ġcalcul":1420,"hat":1421,"olve":1422,"ĠAfter":1423,"pr":1424,"Ġincre":1425,"88":1426,"ons":1427,"Ġsteps":1428,"Ġbr":1429,"Ġpairs":1430,"60":1431,"vel":1432,"Ġabout":1433,"','":1434,"ious":1435,"ively":1436,"Ġformat":1437,"Ġcould":1438,"solute":1439,"quences":1440,"read":1441,"Cost":1442,"Ġlarg":1443,"],[\"":1444,"Ġmeans":1445,"Ġfl":1446,"Ġhelp":1447,"Ġrun":1448,"ĠThis":1449,"ens":1450,"Ġpiles":1451,"asing":1452,"Ġgreater":1453,"ones":1454,"Ġtype":1455,"ank":1456,"Ġabsolute":1457,"respond":1458,"ending":1459,"Ġusing":1460,"wn":1461,"Ġ14":1462,"Ġdescription":1463,"attern":1464,"secut":1465,"empty":1466,"Ġdivisible":1467,"lf":1468,"Ġodd":1469,"Ġ_":1470,"ply":1471,"22":1472,"Ġreach":1473,"Ġquery":1474,"ail":1475,"yp":1476,"Ġcorrespond":1477,"This":1478,"Ġrespect":1479,"oun":1480,"hen":1481,"number":1482,"umn":1483,"Ġstud":1484,"Ġotherwise":1485,"Ġbl":1486,"plete":1487,"Ġobtain":1488,"Ġflo":1489,"Ġprogram":1490,"ĠExample":1491,"Ġmoves":1492,"Ġ30":1493,"Chef":1494,"ark":1495,"Ġneeds":1496,"Ġclass":1497,"Ġ[-":1498,"Ste":1499,"og":1500,"rix":1501,"Ġspec":1502,"any":1503,"ights":1504,"Ġtext":1505,"alled":1506,"Ġstate":1507,"Ġjump":1508,"alind":1509,"avel":1510,"#\",\"":1511,"Ġnodes":1512,"Ġbecomes":1513,"ames":1514,"Ġsorted":1515,"anges":1516,"Ġdown":1517,"Ġad":1518,"Since":1519,"Ġlocations":1520,"ially":1521,"lect":1522,"Ġher":1523,"amet":1524,"89":1525,"Ġsy":1526,"Ġcorrect":1527,"Ġcalled":1528,"Ġanother":1529,"Ġfinish":1530,"Ġfe":1531,"Ġinclud":1532,"here":1533,"Ġlevel":1534,"angu":1535,"org":1536,"itions":1537,"ĠNote":1538,"num":1539,"ically":1540,"Ġconsecut":1541,"Ġbelow":1542,"edia":1543,"____":1544,"Ġ17":1545,"Ġrating":1546,"ĠY":1547,"19":1548,"ĠYour":1549,"Ġvert":1550,"Ġstones":1551,"Ġcoordin":1552,"Ġseparated":1553,"vert":1554,"Ġwhether":1555,"Ġdon":1556,"ĠKata":1557,"Ġ25":1558,"Ġassum":1559,"Ġhead":1560,"Ġopt":1561,"Not":1562,"mat":1563,"Ġcolumn":1564,"âĢĶ":1565,"Arr":1566,"Ġgond":1567,"Ġgondol":1568,"ced":1569,"right":1570,"_**:":1571,"Ġbeg":1572,"Ġru":1573,"Ġlarge":1574,"ba":1575,"17":1576,"be":1577,"Ġdr":1578,"Ġthrough":1579,"Ġcheck":1580,"Pl":1581,"Ġremov":1582,"phab":1583,"ES":1584,"leet":1585,"alk":1586,"iss":1587,"set":1588,"jac":1589,"Ġrout":1590,"led":1591,"Step":1592,"but":1593,"ari":1594,"++++++++++++++++":1595,"Ġqueries":1596,"ec":1597,"21":1598,"Ġarrays":1599,"Ġrespectively":1600,"LL":1601,"ĠZ":1602,"Ġrange":1603,"ĠFirst":1604,"plement":1605,"Ġconnected":1606,"Ġlangu":1607,"Ġvery":1608,"Ġexceed":1609,"ares":1610,"Ġremaining":1611,"arts":1612,"Ġdeterm":1613,"ĠReturn":1614,"ier":1615,"Ġ$\\":1616,"101":1617,"')":1618,"let":1619,"Ġchange":1620,"123":1621,"jacent":1622,"itten":1623,"Ne":1624,"Com":1625,"ages":1626,"Al":1627,"Ġcandies":1628,"Ġsolution":1629,"67":1630,"Ġnumbered":1631,"Ġchild":1632,"^{":1633,"weet":1634,"Ġways":1635,"Name":1636,"Ġvis":1637,"Ġedge":1638,"Ġtoo":1639,"Ġinterval":1640,"ows":1641,"cdot":1642,"/`":1643,"uring":1644,"44":1645,"ĠSeries":1646,"stem":1647,"55":1648,"Ġtestcase":1649,"Print":1650,"Ġconsecutive":1651,"Ġacce":1652,"con":1653,"uch":1654,"Ġ500":1655,"00000":1656,"cases":1657,"Ġpassed":1658,"Ġappe":1659,".\",\"":1660,"Ġfinal":1661,"rue":1662,"ities":1663,"Ġsince":1664,"Ġstop":1665,"make":1666,"Ġpattern":1667,"amp":1668,"Ġ$[":1669,"joy":1670,"Ġmatrix":1671,"Find":1672,"Ġ24":1673,"rome":1674,"':":1675,"Ġconsidered":1676,"Ġrece":1677,"ĠQ":1678,"alindrome":1679,"Ġwritten":1680,"lections":1681,"add":1682,"Ġinst":1683,".)":1684,"]$":1685,"fer":1686,"odu":1687,"imit":1688,"Ġask":1689,"gle":1690,"Ġparamet":1691,"ift":1692,"red":1693,"Ġlook":1694,"Ġstarts":1695,"'.":1696,"Ġemployee":1697,"Ġdata":1698,"icult":1699,"ott":1700,"wap":1701,"Ġhig":1702,"Ġel":1703,"Ġminutes":1704,"Ġag":1705,"ribut":1706,"Let":1707,"ready":1708,"Ġlargest":1709,"Ġnegative":1710,"press":1711,"Ġback":1712,"Ġfull":1713,"ead":1714,"Ġnow":1715,"resents":1716,"ever":1717,"Ġoccur":1718,"Ġobject":1719,"ipedia":1720,"`-":1721,"Ġrepe":1722,"Ġrec":1723,"Ġalready":1724,"negative":1725,"aut":1726,"af":1727,"Ġhand":1728,"Ġwithout":1729,"Ġrepresenting":1730,"lex":1731,"Ġmon":1732,"imes":1733,"Ġargument":1734,"Ġread":1735,"Ġconditions":1736,"Ġstack":1737,"Ġweight":1738,"âĸ":1739,"possible":1740,"Ġmade":1741,"Ġpartic":1742,"Ġdifference":1743,"Ġprice":1744,"Ġ^":1745,"Ġtry":1746,"collections":1747,"After":1748,"max":1749,"ithmetic":1750,"Ġ60":1751,"Ġche":1752,"index":1753,"Ġitem":1754,"ava":1755,"ypes":1756,"ping":1757,"Ġconstraints":1758,"Ġtestcases":1759,"andom":1760,"Ġyear":1761,"Ġtravel":1762,"leetcode":1763,"Ġassume":1764,"plit":1765,"Ġknight":1766,"ener":1767,"Ġupper":1768,"NO":1769,"Ġshown":1770,"clus":1771,"Ġtop":1772,"Ġballs":1773,"Ġalphab":1774,"Im":1775,"atas":1776,"Ġdoesn":1777,"ory":1778,"]],":1779,"return":1780,"Ġcap":1781,"Ġred":1782,"Ġarguments":1783,"`/`":1784,"emb":1785,"Ġcells":1786,"59":1787,"Ġfact":1788,"Ġdescri":1789,"Ġrepl":1790,"find":1791,"word":1792,"Ġbeen":1793,"Ġsquares":1794,"Ġexamples":1795,"....":1796,")`":1797,"ses":1798,"self":1799,"Ġwhile":1800,"At":1801,"count":1802,"Ġwalk":1803,"Ġeat":1804,"ward":1805,"Ġcar":1806,"ici":1807,"clusive":1808,"erv":1809,"Ġadjacent":1810,"ints":1811,"54":1812,"Ġrequired":1813,"Negative":1814,"Ġbou":1815,"Subtasks":1816,"Ġplace":1817,"ram":1818,"Ġconsisting":1819,">>":1820,"bit":1821,"true":1822,"sen":1823,"()](":1824,"Ġdetermine":1825,"80":1826,"Ġpick":1827,"Ġwithin":1828,"ĠCon":1829,"Ġtriple":1830,"Ġunder":1831,"Ġdecimal":1832,"Ġbegin":1833,"Ġcorresponding":1834,"Ġ21":1835,"oney":1836,"iculty":1837,"Create":1838,"Ġwhat":1839,"Ġclo":1840,"92":1841,"Ġstatement":1842,"37":1843,"playing":1844,"Ġimpossible":1845,"1000":1846,"otal":1847,"Ġshort":1848,"bab":1849,"bin":1850,"ored":1851,"Ġvisit":1852,"acket":1853,"Ġroll":1854,"gor":1855,"ĠCh":1856,"69":1857,"Ġmark":1858,"Ġent":1859,"Ġgondola":1860,"Ġbott":1861,"fined":1862,"Ġones":1863,"----------------":1864,"over":1865,"Ġstill":1866,"Ġdef":1867,"els":1868,"34":1869,"Ġrepresents":1870,"uous":1871,"resh":1872,"As":1873,"Ġallow":1874,"An":1875,"ON":1876,"Ġagain":1877,"false":1878,"Ġ19":1879,"iles":1880,"Ġrevers":1881,"where":1882,"vious":1883,"Type":1884,"Playing":1885,"text":1886,"Ġmethods":1887,"ager":1888,"Number":1889,"9999":1890,"Ġbit":1891,"gs":1892,"Ġ200":1893,"Ġ>=":1894,"Ġtable":1895,"Ġsign":1896,"Ġop":1897,"ush":1898,"Ġdep":1899,"min":1900,"AT":1901,"day":1902,"Ġpie":1903,"aw":1904,"book":1905,"wikipedia":1906,"Now":1907,"**_":1908,"cat":1909,"Th":1910,"uplic":1911,"Ġheight":1912,"Ġsmall":1913,"Ġtriang":1914,"ĠTh":1915,"Ġwins":1916,"Ġcompany":1917,"ah":1918,"Ġmoney":1919,"Ġacc":1920,"Ġgener":1921,"Ġbeing":1922,"Ġroutes":1923,"oogle":1924,"\"],[\"":1925,"cy":1926,"reshold":1927,"fect":1928,"arp":1929,"Ġsimple":1930,"graph":1931,"Ġdenotes":1932,"njoy":1933,"1000000":1934,"Ġstand":1935,"Ġ40":1936,"87":1937,"AN":1938,"Ġ32":1939,"ments":1940,"35":1941,"Ġunits":1942,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":1943,"====":1944,"tex":1945,"Ġindices":1946,"Ġass":1947,"Ġpositions":1948,"wh":1949,"ĠAl":1950,"ĠĠĠĠĠĠĠĠĠĠĠĠ":1951,"google":1952,"Ġcoordinates":1953,"Ġtypes":1954,"aint":1955,"Ġsplit":1956,"ased":1957,"Ġlab":1958,"Ġarithmetic":1959,"elp":1960,"Ġcreate":1961,"36":1962,"cending":1963,"Ġformed":1964,"Ġdecided":1965,"oh":1966,"}{":1967,"ume":1968,"pro":1969,"face":1970,"Ġspaces":1971,"Ġcolor":1972,"Ġnumer":1973,"27":1974,"til":1975,"ertex":1976,"Ġold":1977,"makeNegative":1978,"avers":1979,"Ġcommon":1980,"Ġoff":1981,"Ġgold":1982,"AA":1983,"Ġtown":1984,"Ch":1985,"Ġsolve":1986,"Ġdescrib":1987,"^(":1988,"Ġbuy":1989,"```,":1990,"Ġrandom":1991,"Ġroad":1992,"Ġquest":1993,"sitive":1994,"start":1995,"Ġrunning":1996,"tt":1997,"aid":1998,"wiki":1999,"Ġinputs":2000,"xi":2001,"Ġcre":2002,"Ġgive":2003,"Ġking":2004,"avor":2005,"ĠLe":2006,"Ġith":2007,"ĠĠĠĠĠĠĠĠĠĠĠĠĠ":2008,"Ġint":2009,"zz":2010,"Ġallowed":2011,"Ġcalculate":2012,"#\",\"#\",\"":2013,"Ġrob":2014,"Ġtravers":2015,"Ġwhose":2016,"igit":2017,"Ġreg":2018,"City":2019,"Ġyi":2020,"ffici":2021,"ific":2022,"Ġbouqu":2023,"input":2024,"ose":2025,"Ġspeed":2026,"aking":2027,"fr":2028,"YES":2029,"Ġsample":2030,"Ġobtained":2031,"pp":2032,"Ġclos":2033,"Ġterm":2034,"Ġsold":2035,"owever":2036,"ĠTrue":2037,"ees":2038,"Ġwere":2039,"abcd":2040,"Ġblock":2041,"Ġins":2042,"ouble":2043,"`-`":2044,"Ġnull":2045,"Ġsequences":2046,"Ġtests":2047,"ings":2048,"Ġ105":2049,"64":2050,"Ġswap":2051,"Ġrepresented":2052,"Ġchef":2053,"ouse":2054,"Ġrules":2055,"Ġduring":2056,"os":2057,"Ġcondition":2058,"Ġ!":2059,"ides":2060,"[[":2061,"Ġroot":2062,"Ġfloor":2063,"Ġconnect":2064,"Ġlimit":2065,"Ġph":2066,"hest":2067,"anged":2068,"Ġcards":2069,"ify":2070,"Ġroom":2071,"Ġchess":2072,"ale":2073,"Ġrest":2074,"Ġprov":2075,"irth":2076,"70":2077,"bb":2078,"Ġblue":2079,"90":2080,"cle":2081,"idd":2082,"numbers":2083,"Ġsystem":2084,"Day":2085,"EX":2086,"bo":2087,"Ġstudents":2088,"action":2089,"Ġ&":2090,"OR":2091,"name":2092,"Ġbask":2093,"wor":2094,"Max":2095,"'re":2096,"111":2097,"ĠĠĠĠĠĠĠĠĠĠĠ":2098,"Ġsatisfy":2099,"cts":2100,"Ġvertices":2101,"Ġluck":2102,"loom":2103,"Ġpalindrome":2104,"dots":2105,"Ġtre":2106,"Ġbuild":2107,"atest":2108,"iguous":2109,"Of":2110,"ĠFind":2111,"Ġwordlist":2112,"ikes":2113,"ĠOn":2114,"85":2115,"Ġlanguage":2116,"31":2117,"Ġnames":2118,"ual":2119,"Ġwater":2120,"Ġcomplete":2121,"rder":2122,"Size":2123,")_**":2124,"Ġrectangle":2125,"Ġuntil":2126,"ython":2127,"Ġassign":2128,"Ġdi":2129,"],[-":2130,"arent":2131,"Alice":2132,"ef":2133,"struct":2134,"ren":2135,"Ġcustomer":2136,"creasing":2137,"ility":2138,"Ġour":2139,"ĠEnjoy":2140,"Ġyears":2141,"Notice":2142,"ograph":2143,"aving":2144,"Ġmy":2145,"Ġdefined":2146,"Ġhour":2147,"aced":2148,"ĠWith":2149,"Ġq":2150,"xx":2151,"Ġcur":2152,"Ġproper":2153,"ohn":2154,"No":2155,"facebook":2156,"ĠLet":2157,"Ġdirect":2158,"),(":2159,"ily":2160,"39":2161,":**":2162,"no":2163,"Ġfew":2164,"âĢĻ":2165,"(-":2166,"Ġneeded":2167,"integ":2168,"az":2169,"Ġfavor":2170,"Ġrows":2171,"Ġshortest":2172,"Ġaccept":2173,"Ġplayers":2174,"Ġboarding":2175,"String":2176,"Ġbloom":2177,"Ġelse":2178,"Ġcollect":2179,"Ġequals":2180,"Ġ[]":2181,"Ġcities":2182,"Ġ`'":2183,"pos":2184,"Ġconvert":2185,"arrow":2186,"Ġfriends":2187,"gorithm":2188,"grid":2189,"âĸł":2190,"Ġbeginning":2191,"$).":2192,"Ġpresent":2193,"Ġarea":2194,"left":2195,"So":2196,"Ġfig":2197,"ĠTo":2198,"valid":2199,"ĠrunningCost":2200,"ĠboardingCost":2201,"ples":2202,"Ġsubset":2203,"eng":2204,"Ġcomput":2205,"Ġfourth":2206,"ĠSince":2207,"indexed":2208,"lean":2209,"Ġhighest":2210,"land":2211,"Ġ26":2212,"Ġmonth":2213,"icograph":2214,"Ġmanager":2215,"Ġreturned":2216,"Ġinstead":2217,"Ġrel":2218,"ĠĠĠĠĠĠĠĠĠĠ":2219,"Ġinitially":2220,"Ġcall":2221,"ĠPo":2222,"Ġ['":2223,"ately":2224,"Ġchosen":2225,"Here":2226,"Ġmess":2227,"ĠNotes":2228,"Ġ(`":2229,"Ġsk":2230,"ĠNumbers":2231,"01":2232,"king":2233,"Ġseg":2234,"))":2235,"Array":2236,"Ġgoing":2237,"*.":2238,"Ġremoving":2239,"Ġpaint":2240,"ĪĴ":2241,"Ġhor":2242,"Ġdest":2243,"```.":2244,"Ġincreasing":2245,"Ġamong":2246,"Ġbecome":2247,"Ġput":2248,"reak":2249,"Ġhap":2250,"bar":2251,"ertain":2252,"To":2253,"Ġduplic":2254,"Ġanswers":2255,"cluding":2256,"iddle":2257,"oding":2258,"Ġ)":2259,"idth":2260,"iction":2261,"Ġprime":2262,"ror":2263,"Ġrepresentation":2264,"Ġjumps":2265,"Ġmatch":2266,"uby":2267,"gg":2268,"Ġ2000":2269,"Ġnever":2270,"Ġvow":2271,"Ġlex":2272,"Ġlead":2273,"ember":2274,"1010":2275,"})":2276,"Ġ;":2277,"Ġprocess":2278,"ID":2279,"BB":2280,"Implement":2281,"ĠĠĠĠĊ":2282,"ills":2283,"Ġ36":2284,"Ġprevious":2285,"Ġoptim":2286,"ĠAn":2287,"PL":2288,"Ġcut":2289,"ke":2290,"Ġenc":2291,"that":2292,"Ġzeros":2293,".\",\".\",\"":2294,"ĠSubtask":2295,"ighb":2296,"Ġcontin":2297,"rightarrow":2298,"Ġev":2299,"char":2300,"Ġlit":2301,"herit":2302,"Ġhere":2303,"Ġsubarrays":2304,"Ġfold":2305,"Ġer":2306,"nums":2307,"Ġrank":2308,"Ġprodu":2309,"ults":2310,"ording":2311,"Ġemployees":2312,"Ġsubsequences":2313,"\":":2314,"Ġact":2315,"Ġplan":2316,"heritance":2317,"ilar":2318,"kl":2319,"Ġrepeated":2320,"Ġwall":2321,"Ġminute":2322,"ĠALL":2323,"urren":2324,"eg":2325,"bc":2326,"Ġrectangles":2327,"Case":2328,"ĠBut":2329,"pression":2330,"Ġcertain":2331,"ĠString":2332,"pan":2333,"Ġwhole":2334,"ta":2335,"Ġlexicograph":2336,"iving":2337,"izon":2338,"Ġspecial":2339,"order":2340,"Ġ109":2341,"Ġlink":2342,"aba":2343,"Ġmag":2344,"Ġfound":2345,"ty":2346,"div":2347,"Ġgives":2348,"finite":2349,"Ġmiddle":2350,"Ġneighb":2351,"Ġstone":2352,"Order":2353,"Ġcir":2354,"Ġthose":2355,"bob":2356,"Ġappear":2357,"onent":2358,"pre":2359,"Ġâī":2360,"97":2361,"}.":2362,"edian":2363,"Ġexist":2364,"foo":2365,"way":2366,"oc":2367,"Ġlengths":2368,"Ġforce":2369,"ended":2370,"br":2371,"Ġtriangle":2372,"Ġfollowed":2373,"pose":2374,"Ġfavorite":2375,"Total":2376,"105":2377,"When":2378,"next":2379,"Ġgoes":2380,"Po":2381,"line":2382,"sing":2383,"Ġresulting":2384,"Please":2385,"bd":2386,"acci":2387,"ĠFalse":2388,"Ġalphabet":2389,"sub":2390,"Ġproblems":2391,"Ġplease":2392,"Ġmaxim":2393,"He":2394,"Ġbreak":2395,"lements":2396,"ki":2397,"points":2398,"Ġdelet":2399,"ya":2400,"Ġchoo":2401,"Ġaddition":2402,"Ġincluding":2403,"26":2404,"ATI":2405,"Ġbest":2406,"Complete":2407,"plet":2408,"output":2409,"ĠOne":2410,"Ġbook":2411,"ashi":2412,"ccess":2413,"eters":2414,"ian":2415,"solve":2416,"Ġitself":2417,"On":2418,"anced":2419,"ĠTak":2420,"Ġfactor":2421,"Ġquotes":2422,"from":2423,"ounts":2424,"Ġfigure":2425,"Ġoperator":2426,"Ob":2427,"Be":2428,"als":2429,"Ġban":2430,"Ġbase":2431,"âĢī":2432,"asic":2433,"onacci":2434,"Good":2435,"eep":2436,"ĠHowever":2437,"]$,":2438,"Ġalgorithm":2439,"Ġmov":2440,"****":2441,"agram":2442,"Ġage":2443,"Ġ-$":2444,"words":2445,"29":2446,"??":2447,"Ġwaiting":2448,"ssib":2449,"Ġatt":2450,"can":2451,"ATION":2452,"Ġseries":2453,"Ġwell":2454,"Ġdifficulty":2455,"Ġ23":2456,"ello":2457,"Ġgets":2458,"ANATION":2459,"EXPL":2460,"EXPLANATION":2461,"Ġinv":2462,"fficient":2463,"[\"":2464,"56":2465,"ĠĠĠĊ":2466,"Ġfit":2467,"Ġparameters":2468,"Ġable":2469,"thing":2470,"Ġparent":2471,"ia":2472,"Ġcolumns":2473,"iers":2474,"arm":2475,"card":2476,"comm":2477,"ĠMore":2478,")$.":2479,"posit":2480,"Ġinfinite":2481,"Test":2482,"arden":2483,"Ġhi":2484,"board":2485,"Ġeas":2486,"ified":2487,"]$.":2488,"ule":2489,"Ġnecess":2490,"ĠWhen":2491,"Ġdistribut":2492,"ross":2493,"arch":2494,"Ġ_,":2495,"Ġplaying":2496,"Ġwinner":2497,"Ġsl":2498,"Ġpack":2499,"ĠRem":2500,"Ġweights":2501,"my":2502,"Ġsay":2503,"olv":2504,"Ġdirection":2505,"ictionary":2506,"uzz":2507,"Ġrequests":2508,"Ġparticip":2509,"key":2510,"ains":2511,"Ġflow":2512,"verage":2513,"ips":2514,"Ġ34":2515,"ites":2516,"Ġends":2517,"Ġbel":2518,"Ġ27":2519,"Ġtell":2520,"ĠCan":2521,"Ġcombin":2522,"Ġmuch":2523,"chie":2524,"ouses":2525,"you":2526,"Ġsmaller":2527,"Ġoptimally":2528,"Ġmiss":2529,"ĠPr":2530,"ĠCity":2531,"Ġindic":2532,"Ġtransl":2533,"Ġachie":2534,"imens":2535,"avas":2536,"avascript":2537,"ahashi":2538,"Ġ22":2539,"Ġfun":2540,"Then":2541,"Ġprovided":2542,"peed":2543,"Ġmessage":2544,"ics":2545,"lete":2546,"First":2547,"without":2548,"Ġaccording":2549,"rm":2550,"Ġhorizon":2551,"Qu":2552,"Ġwon":2553,")$,":2554,"Ġcr":2555,"itially":2556,"Ġvol":2557,"Ġparameter":2558,"ĠSe":2559,"sl":2560,"Ġascending":2561,"Ġpiece":2562,"Ġ!!":2563,"Ġgarden":2564,"Ġuppercase":2565,"Ġfully":2566,"'ll":2567,"alanced":2568,"Ġprobab":2569,"ures":2570,"|,":2571,"++++++++++++++++++++++++++++++++":2572,"ped":2573,"Ġbutt":2574,"Ġinclusive":2575,"Ġopen":2576,"by":2577,"icks":2578,"ĠNow":2579,"pts":2580,"Ġseconds":2581,"84":2582,"Product":2583,"therwise":2584,"Ġrobot":2585,"345":2586,"Ġlabel":2587,"andard":2588,"11111":2589,"Val":2590,"ĠStandard":2591,"Ġstruct":2592,"less":2593,"Numbers":2594,"Ġreac":2595,"ĠNumber":2596,"Ġident":2597,"Ġoccurs":2598,"Ġdel":2599,"Ġ(\"":2600,"ming":2601,"lev":2602,"alf":2603,"Ġteams":2604,"####":2605,"llo":2606,"Ġinterest":2607,"IS":2608,"ĠGiven":2609,"Ġsubstrings":2610,"Ġcoin":2611,"ches":2612,"Ġdescribed":2613,"qr":2614,"Ġlinked":2615,"']":2616,"ived":2617,"frac":2618,"Ġdoll":2619,"Ġintervals":2620,"rep":2621,"rd":2622,"pop":2623,"Ġitems":2624,"Ġfree":2625,"co":2626,"att":2627,"Ġstrict":2628,"Ġchoice":2629,"ĠUn":2630,"Ġhouse":2631,"ually":2632,"ital":2633,"Ġperfect":2634,"321":2635,"fix":2636,"ĠâĨ":2637,"Ġboy":2638,"Re":2639,"Ġremoved":2640,"Ġnote":2641,"Ġbig":2642,"Ġfam":2643,"ĠHelp":2644,"acity":2645,"Ġuses":2646,"Ġbits":2647,"ĠTakahashi":2648,"Ġtriplets":2649,"Arrays":2650,"Ġhaving":2651,"Ġexcept":2652,"!\"":2653,"ÃĹ":2654,"times":2655,"ula":2656,"*,":2657,"Ġdie":2658,"Ġlexicographically":2659,"Ġinvalid":2660,"netic":2661,"ĠAt":2662,"askell":2663,"Ġturns":2664,"Elements":2665,"ield":2666,"Ġoranges":2667,"None":2668,"alleng":2669,"Ġshift":2670,"Ġvers":2671,"Ġsn":2672,"Ġpop":2673,"ĠAlex":2674,"Ġdivisors":2675,"Ġbouquets":2676,"including":2677,"Ġship":2678,"work":2679,"ĠNo":2680,"arning":2681,"stru":2682,"ared":2683,"75":2684,"Ġdictionary":2685,"edges":2686,"Ġresults":2687,"Ġconnecting":2688,"Ġquestion":2689,"Ġhtt":2690,"Ġbeaut":2691,"zero":2692,"Ġhot":2693,"gether":2694,"Ġserv":2695,"port":2696,"ĠAs":2697,"Ġ300":2698,"Ġreplace":2699,"tweet":2700,"Ġsto":2701,"150":2702,"Ġreceive":2703,"ather":2704,"Ġhouses":2705,"Ġcover":2706,"loc":2707,"Ġtimest":2708,"From":2709,"Ġblack":2710,"most":2711,"42":2712,"Ġï":2713,"Ġenough":2714,"Ġbul":2715,"lap":2716,"Ġsent":2717,"aken":2718,"200":2719,"aper":2720,"omin":2721,"ature":2722,"actions":2723,"]=":2724,"Ġbanan":2725,"Ġcontiguous":2726,"¹Ī":2727,"Ġï¹Ī":2728,"ma":2729,"rectang":2730,"play":2731,"Ġinformation":2732,"Ġchocol":2733,"Ġsides":2734,"Ġkeep":2735,"$),":2736,"Ġlanguages":2737,"Ġplaces":2738,"Ġpress":2739,"product":2740,"Ġcapacity":2741,"lists":2742,"Ġav":2743,"pected":2744,"xes":2745,"76":2746,"Digit":2747,"lcom":2748,"Ġwelcom":2749,"âĪĴ":2750,"Ġdecre":2751,"Ġflowers":2752,"Ġstructure":2753,"Ġtogether":2754,"two":2755,"atch":2756,"\"`.":2757,"ness":2758,"Ġown":2759,"\\\\":2760,"ght":2761,"Script":2762,"push":2763,"dist":2764,"Ġsever":2765,"Ġstrictly":2766,"uer":2767,"sharp":2768,"Ġtem":2769,"ects":2770,"More":2771,"Ġtraversed":2772,"Ġbananas":2773,"math":2774,"gre":2775,"mally":2776,"Ġtaken":2777,"ĠAlso":2778,"Mr":2779,"aaaa":2780,"arn":2781,"Ġnumeric":2782,"Hello":2783,"oolean":2784,"alth":2785,"ĠPython":2786,"ĠEx":2787,"round":2788,"ĠThat":2789,"nu":2790,"ĠPlease":2791,"ĠVertex":2792,"Ġbeer":2793,"Ġkind":2794,"users":2795,"Compan":2796,"Companies":2797,"ibonacci":2798,"Ġstre":2799,"Ġ106":2800,"12345":2801,"sort":2802,"Ġsched":2803,"]`,":2804,"Ġdial":2805,"Ġasked":2806,"Object":2807,"Sum":2808,"Ġloo":2809,"anging":2810,"Ġstation":2811,"ij":2812,"ful":2813,"acing":2814,"Se":2815,"IN":2816,"Ġmean":2817,"Ġsure":2818,"ances":2819,"Ġprefix":2820,"ently":2821,"ĠinformTime":2822,"Ġstudent":2823,"Ġfix":2824,"Ġhard":2825,"Ġdivide":2826,"Ġ__":2827,"38":2828,"ssibly":2829,"ĠShe":2830,"Ġchildren":2831,"AB":2832,"Ġexp":2833,"atur":2834,"11111111":2835,"ĠThey":2836,"Ġaccepted":2837,"stac":2838,"ĠLists":2839,"Ġcommand":2840,"Queries":2841,"Ġtimestamp":2842,"afe":2843,"racket":2844,"\");":2845,"Ġreverse":2846,"Ġ28":2847,"Ġneighbor":2848,"Ġsums":2849,"roy":2850,"Ġmight":2851,"48":2852,"Ġjobs":2853,"Ġtw":2854,"mb":2855,"Ġpur":2856,"Ġscores":2857,"Ġlow":2858,"cont":2859,"oes":2860,"Ġkeys":2861,"Ġtrees":2862,"ĠbloomDay":2863,"oid":2864,"Ġgir":2865,"Ġmedian":2866,"Ġcoordinate":2867,"ized":2868,"slash":2869,"Ġchooses":2870,"Ġcoding":2871,"au":2872,"Ġboxes":2873,"Ġassigned":2874,"Ġhapp":2875,"Ġtransform":2876,"Ġhome":2877,"Ġshow":2878,"Ġcome":2879,"Ġhigh":2880,"Ġdraw":2881,"ody":2882,"Ġdone":2883,"Ġpartition":2884,"Ġisn":2885,"ĠâĢķ":2886,"Ġunit":2887,"Ġstrong":2888,"izz":2889,"Ġbaskets":2890,"Ġaccepts":2891,"Ġ`{":2892,"Ġaround":2893,"even":2894,"\"]]":2895,"Ġsegment":2896,"Ġdollars":2897,"Ġreal":2898,"like":2899,"Ġhalf":2900,"Ġalong":2901,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":2902,"ĠâĨĴ":2903,"Ġoccurren":2904,"Ġ37":2905,"Ġlikes":2906,"Ġsolutions":2907,"birth":2908,"ĠcurOrder":2909,"Ġgoal":2910,"Ġdestroy":2911,"ĠTherefore":2912,"csharp":2913,"Ġseveral":2914,"Ġfolder":2915,"40000":2916,"Ġconstruct":2917,"Ġbottom":2918,"divis":2919,"should":2920,"Ġflip":2921,"`)":2922,"6789":2923,"Ġpoly":2924,"ĠNone":2925,"]^":2926,"]|":2927,"Ġ29":2928,"Ġhad":2929,"integer":2930,"Ġaverage":2931,"Ġrounded":2932,"hored":2933,"Ġcook":2934,"Ġwhite":2935,"cream":2936,"Ġleading":2937,"Ġimplement":2938,"Ġthreshold":2939,"Ġcontest":2940,"Every":2941,"Ġ!=":2942,"Kata":2943,"Ġexpression":2944,"rectangle":2945,"Ġ}":2946,"Ġextr":2947,"Ġdiscount":2948,"ÂłĠĠĠĠĠĠĠĠĠĠĠĠĠ":2949,"Ġlarger":2950,"II":2951,"Ġredu":2952,"Node":2953,"Ġasks":2954,"Ġapply":2955,"authored":2956,"ĠKatas":2957,">>>":2958,"Ġ20000":2959,"Ġexpected":2960,"iod":2961,"qrt":2962,"Ġ`(":2963,"Ġwar":2964,"Ġpay":2965,"Ġcy":2966,"OfNumbers":2967,"izes":2968,"Threshold":2969,"Ġve":2970,"ched":2971,"Ġ40000":2972,"Ġ`-":2973,"odd":2974,"Ġdepending":2975,"Ġsoldier":2976,"Ġhigher":2977,"ĠConstraints":2978,"Ġdenote":2979,"Ġsur":2980,"ĠDe":2981,"Tweet":2982,"Ġyj":2983,"aster":2984,"Ġ$|":2985,"Ġgot":2986,"Ġvolume":2987,"Ġphone":2988,"dire":2989,"Ġthink":2990,"Ġcolors":2991,"Ġtranslations":2992,"Ġdid":2993,"Ġrefer":2994,"Ġ100000":2995,"Ġ%":2996,"ivers":2997,"row":2998,"rid":2999,"Counts":3000,"Value":3001,"Yes":3002,"time":3003,"ĠJava":3004,"Ġthrow":3005,"Ġ5000":3006,"verse":3007,"rary":3008,"nuke":3009,"Ass":3010,"Bo":3011,"requ":3012,"hing":3013,"Ġ99":3014,"ackets":3015,"me":3016,"alice":3017,"Ġdefine":3018,"ml":3019,"sc":3020,"orm":3021,"Ġdice":3022,"],[],[":3023,"Ġcolour":3024,"Ġsup":3025,"tun":3026,"ystem":3027,"hour":3028,"Ġoptimal":3029,"ole":3030,"hello":3031,"aab":3032,"uit":3033,"represent":3034,"Ġchalleng":3035,"$$":3036,"Ġdro":3037,"Ġbrackets":3038,"Inheritance":3039,"ĠMethod":3040,"Ġtwice":3041,"both":3042,"may":3043,"Ġlocated":3044,"ĠheadID":3045,"Ġcosts":3046,"Ġclosest":3047,"([\"":3048,"xor":3049,"Â·":3050,"Ġdish":3051,"Ġext":3052,"Ġsafe":3053,"jects":3054,"Ġwidth":3055,"------------":3056,"cent":3057,"posed":3058,"Ġbar":3059,"Ġ>>":3060,"Ġfaces":3061,"Ġworld":3062,"ĠAnd":3063,"amed":3064,"Ġ90":3065,"Ġlatest":3066,"Ġcurrently":3067,"Ġachieve":3068,"ms":3069,"Ġcour":3070,"ittle":3071,"Ġorigin":3072,"Ġtick":3073,"aur":3074,"oS":3075,"}$.":3076,"hemat":3077,"ĠarrayObject":3078,"xy":3079,"ĠrollMax":3080,"kn":3081,"nce":3082,"Ġet":3083,"Ġvertex":3084,"Ġsepar":3085,"Ġpasseng":3086,"Ġstat":3087,"Ġpeak":3088,"Ġ[[-":3089,"ifficulty":3090,"Ġdelete":3091,"110":3092,"ellow":3093,"Ġide":3094,"Ġsatisfies":3095,"Ġ[[\"":3096,"Ġworker":3097,"ls":3098,"Ġisland":3099,"Ġstarted":3100,"ĠfavoriteCompanies":3101,"cho":3102,"gy":3103,"ason":3104,"Sub":3105,"Ġfile":3106,"Bob":3107,"oad":3108,"Ġgues":3109,"Ġaltern":3110,"58":3111,"Le":3112,"Also":3113,"such":3114,"ional":3115,"Ġcorner":3116,"irror":3117,"Ġuser":3118,"Stack":3119,"Ġbound":3120,"ĠOtherwise":3121,"arily":3122,"Ġ50000":3123,"\"`,":3124,"09":3125,"Ġschedule":3126,"Ġser":3127,"ĠJohn":3128,"$;":3129,"Ġquer":3130,"Ġdecide":3131,"Ġetc":3132,"Ġtu":3133,"Ġvowel":3134,"Ġparticular":3135,"uation":3136,"Ġcompute":3137,"'`":3138,"Ziz":3139,"ĠNext":3140,"crement":3141,"Ġparts":3142,"Ġcreated":3143,"oScream":3144,"ZizoScream":3145,"trodu":3146,"gon":3147,"png":3148,"Ġbutton":3149,"caten":3150,"âī":3151,"Ġcake":3152,"Ġforward":3153,"Ġwelcomed":3154,"ĠLearning":3155,"Ġprobability":3156,"Ġ(-":3157,"Ġknows":3158,"Ġ12345":3159,"agon":3160,"itial":3161,"Ġbased":3162,"=[":3163,"ĠdistanceThreshold":3164,"peak":3165,"izou":3166,"ĠZizou":3167,"ĠEnjoyable":3168,"MrZizoScream":3169,"âĸłâĸł":3170,"Ġqueried":3171,"bet":3172,"lyc":3173,"Ġ104":3174,"iting":3175,"ĠXOR":3176,"rypt":3177,"Ġspell":3178,"tri":3179,"airs":3180,"Ġapples":3181,"Ġpermutations":3182,".\"":3183,"ination":3184,"ĠSu":3185,"()`":3186,"Ġobstac":3187,"lycarp":3188,"Ġbill":3189,"Ġrotating":3190,"Ġmakes":3191,"Ġdivided":3192,"68":3193,"Ġsupp":3194,"1000000000":3195,"enari":3196,"ĠHence":3197,"Ġappears":3198,"Difficulty":3199,"Ġdimens":3200,"Ġlists":3201,"iful":3202,"\",\"/":3203,"Ġcapital":3204,"ĠStreamChecker":3205,"StreamChecker":3206,"value":3207,"Ġrearr":3208,"Ġchanges":3209,"PS":3210,"mi":3211,"]:":3212,"65":3213,"Ġsearch":3214,"Ġ**_(":3215,"Ġ1000000000":3216,"head":3217,"decreasing":3218,"Ġhotel":3219,"finish":3220,"type":3221,"`:":3222,"Ġwaits":3223,"ĠSh":3224,"Ġbirth":3225,"side":3226,"Ġselect":3227,"Ġpix":3228,"Ġsele":3229,"Ġplayed":3230,"love":3231,"ĠÂł":3232,"ĠOr":3233,"Ġgreatest":3234,"Ġroute":3235,"Rec":3236,"ĠAi":3237,"Ġcontained":3238,"inter":3239,"Ġgondolas":3240,"Ġnamed":3241,"Ġlowest":3242,"Ġbetter":3243,"igits":3244,"Ġperiod":3245,"Ġlot":3246,"numbered":3247,"embers":3248,"Ġ]":3249,"Ġcent":3250,"Ġsubordin":3251,"ĠmaxSize":3252,"Ġbeautiful":3253,"Ġâī¦":3254,"ĠReturns":3255,"apple":3256,"Ġrounds":3257,"Ġparty":3258,"Ġmathemat":3259,"Ġdesired":3260,"istory":3261,"ĠkeyTime":3262,"locations":3263,"dr":3264,"Ġmeters":3265,"Ġinstru":3266,"neq":3267,"Ġbasket":3268,"Ġremoves":3269,"azon":3270,"15088":3271,"pace":3272,"Ġcolle":3273,"gta":3274,"java":3275,"mm":3276,"Ġground":3277,"Ġdivisor":3278,"ves":3279,"Ġnight":3280,"Ġpuzz":3281,"ĠCom":3282,"ĠAr":3283,"ĠBoth":3284,"ends":3285,"cept":3286,"Notes":3287,"nam":3288,"Ġadded":3289,"Un":3290,"Ġfight":3291,"Ġeng":3292,"De":3293,"lockwise":3294,"move":3295,"ĠBe":3296,"Ġincluded":3297,"Ġbottles":3298,"Ġevent":3299,"load":3300,"Ġgreen":3301,"Ġaway":3302,"Ġcandy":3303,"Ġmissing":3304,"Ġversion":3305,"Ġ({":3306,"ĠAN":3307,"ĠMethods":3308,"ek":3309,"Ġloop":3310,"Ġconcaten":3311,"Cons":3312,"mbol":3313,"which":3314,"sm":3315,"atural":3316,"79":3317,"Ġsaid":3318,"Ġsolv":3319,"pec":3320,"Ġ('":3321,"alling":3322,"enario":3323,"between":3324,"Ġrequest":3325,"Ġhours":3326,"Boxes":3327,"Ġtaking":3328,"Ġ49":3329,"Ġquestions":3330,"Ġsimilar":3331,"True":3332,"Ġbulb":3333,"likes":3334,"Ġpieces":3335,"@@":3336,"ayer":3337,"known":3338,"javascript":3339,"Ġincrease":3340,"requen":3341,"Ġlake":3342,"Ġstanding":3343,"ĠHere":3344,"#\"],":3345,"man":3346,"tally":3347,"Ġlooks":3348,"Help":3349,"Ġprep":3350,"Ġfrog":3351,"ru":3352,"Ġmom":3353,"multi":3354,"Ġordered":3355,"amazon":3356,"orph":3357,"Ġsom":3358,"plus":3359,"106":3360,"Ġmagnetic":3361,"Ġcub":3362,"ires":3363,"iginal":3364,"Ġenter":3365,"ĠArr":3366,"arry":3367,"ĠWrite":3368,"Ġbouquet":3369,"orphic":3370,"Ġinside":3371,"aps":3372,"'ve":3373,"Ġ000":3374,"âĢĿ":3375,"non":3376,"orts":3377,"ounter":3378,"thew":3379,"aj":3380,"Ġstore":3381,"plied":3382,"Ġexam":3383,"ĠThus":3384,"Ġblocks":3385,"Ġpaper":3386,"plication":3387,"Ġadditional":3388,"representing":3389,"abab":3390,"Ġeasy":3391,"Ġflower":3392,"erved":3393,"Ġplaced":3394,"Ġarrange":3395,"Ġmultiply":3396,"tv":3397,"ization":3398,"},{":3399,"86":3400,"Ġvari":3401,"Ġcomplet":3402,"rating":3403,"arl":3404,"ĠMath":3405,"120":3406,"Ġsatisfied":3407,"tunately":3408,"43":3409,"plane":3410,"levator":3411,"bl":3412,"Make":3413,"piles":3414,"ails":3415,")(":3416,"aight":3417,"Ġboolean":3418,"umping":3419,"Ġkatas":3420,"Ġrotate":3421,"Ġstacks":3422,"come":3423,"Ġstraight":3424,"~\\":3425,"ished":3426,"Ġanimal":3427,"ĠTri":3428,"ids":3429,"âĢ¦":3430,"da":3431,"Ġapp":3432,"|=":3433,"Ġidentical":3434,"itch":3435,"**.":3436,"=====":3437,"LD":3438,"ting":3439,"ords":3440,"omb":3441,"47":3442,"Sim":3443,"Ġmer":3444,"Ġarbit":3445,"Ġwhites":3446,"Ġsimply":3447,"ny":3448,"cons":3449,"flo":3450,"ĠNO":3451,"Ġapple":3452,"ders":3453,"OK":3454,"will":3455,"Ġworking":3456,".`":3457,"\"].":3458,"squ":3459,"What":3460,"Ġegg":3461,"Ġfamily":3462,"ky":3463,"Ġfore":3464,"Ġfield":3465,"Ġchain":3466,"ha":3467,"Ġfil":3468,"cf":3469,"ifts":3470,"ries":3471,"andy":3472,"iel":3473,"ĠLee":3474,"63":3475,"check":3476,"ĠSum":3477,"requency":3478,"chool":3479,"Ġcare":3480,"Ġnecessarily":3481,"Ġslices":3482,"Ġending":3483,"ĠÃĹ":3484,"Ġdog":3485,"Ġnews":3486,"573":3487,"Ġranges":3488,"One":3489,"ient":3490,"Ġcars":3491,"NOT":3492,"Ġtriplet":3493,"Ġ45":3494,"Ġrains":3495,"ried":3496,"AC":3497,"Ġfinally":3498,"Ġunivers":3499,"Some":3500,"Ġsquared":3501,"Ġstamp":3502,"654":3503,"ware":3504,"Ġalphabetic":3505,"Ġfive":3506,"Ġactiv":3507,"Ġminimal":3508,"ius":3509,"Ġing":3510,"Consider":3511,"_**.":3512,"ĠEvery":3513,"Ġextra":3514,"ĠSub":3515,"ined":3516,"600":3517,"ctor":3518,"perm":3519,"Ġreaches":3520,"fuel":3521,"arg":3522,"Ġthings":3523,"mon":3524,"Ġhence":3525,"Ġmarks":3526,"alent":3527,"Ġbelong":3528,"XX":3529,"iver":3530,"orld":3531,"Ġappro":3532,"inclusive":3533,"âĻ":3534,"Ġcross":3535,"etition":3536,"plain":3537,"plist":3538,"Ġtemper":3539,"iness":3540,"tract":3541,"ences":3542,"Ġbracket":3543,"Ġdeleting":3544,"ountain":3545,"572":3546,"Ġur":3547,"Ġprede":3548,"ae":3549,"Ġhold":3550,"Ġcalls":3551,"False":3552,"Ġnice":3553,"Ġregular":3554,"Ġshows":3555,"Ġinters":3556,"!!\"":3557,"Ġsubm":3558,"Ġvowels":3559,"Ġcourse":3560,"10101":3561,"Ġtrain":3562,"posite":3563,"Ġtrying":3564,"Ġ92":3565,"Ġcombination":3566,"ĠArray":3567,"rec":3568,"ane":3569,"Ġsoldiers":3570,"pie":3571,"**,":3572,"cessor":3573,")```":3574,"uming":3575,"Ġanything":3576,"upper":3577,"`[":3578,"ource":3579,"characters":3580,"Ġign":3581,"ĠminSize":3582,"mer":3583,"Ġconst":3584,"ĠstartTime":3585,"Ġoutside":3586,"Ġaddress":3587,"Ġmembers":3588,"utom":3589,"Ġscenario":3590,"Ġwriting":3591,"Ġchanging":3592,"oded":3593,"possibly":3594,"ĠÂłĠĊ":3595,"300":3596,"atives":3597,"Ġ70":3598,"Ġticket":3599,"Ġ----":3600,"Ġ\"/":3601,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":3602,"Ġpict":3603,"appy":3604,"ailable":3605,"Ġvar":3606,"Ġdisplay":3607,"EN":3608,"Ġsell":3609,"iew":3610,"Ġdishes":3611,"attle":3612,"Ġpredecessor":3613,"ĠRe":3614,"109":3615,"DD":3616,"binom":3617,"ĠOnly":3618,"Ġlabelled":3619,"08":3620,"AS":3621,"Ġ35":3622,"Ġjo":3623,"commended":3624,"Ġexponent":3625,"Ġrotation":3626,"Ġingred":3627,"digit":3628,"dbinom":3629,"Ġgreat":3630,"Ġque":3631,")\"":3632,"Ġ120":3633,"6666":3634,"ĠRs":3635,"67890":3636,"...,":3637,"Ġsubordinates":3638,"122":3639,"With":3640,"ster":3641,"Ġyen":3642,"Ġsymbol":3643,"Ġoccurrences":3644,"Ġarbitrary":3645,"-)":3646,"wards":3647,"textrm":3648,"Map":3649,"ties":3650,"ĠCA":3651,"Ġchanged":3652,"Ġ80":3653,"Ġtowns":3654,"Ġtherefore":3655,"Ġdirectly":3656,"49":3657,"]`.":3658,"finition":3659,"Ġchocolates":3660,"fortunately":3661,"Ġrelative":3662,"ral":3663,"asha":3664,"Ġsix":3665,"ĠSnuke":3666,"Ġcircle":3667,"Ġfif":3668,"ised":3669,"then":3670,"Ġinclude":3671,"'],":3672,"DE":3673,"Wh":3674,"ok":3675,"Ġnatural":3676,"3333":3677,"ĠjobDifficulty":3678,")\",\"":3679,"fe":3680,"umpy":3681,"mod":3682,"oplus":3683,"Ġtasks":3684,"Ġoldest":3685,"Ġdistribute":3686,"eting":3687,"integers":3688,"izza":3689,"*(":3690,"Ġreceives":3691,"Ġmoving":3692,"Ġ150":3693,"\").":3694,"down":3695,"Ġlearn":3696,"first":3697,"Ġvertically":3698,"Ġstatus":3699,"ĠInitially":3700,"limit":3701,"Ġplays":3702,"Ġrule":3703,"Ġ61":3704,"ern":3705,"kiplist":3706,"Ġcarry":3707,"endent":3708,"]).":3709,"ĠPolycarp":3710,"productOfNumbers":3711,"Ġpassengers":3712,"has":3713,"abac":3714,"Ġreceived":3715,"cur":3716,"digits":3717,"function":3718,"Ġmain":3719,"ivalent":3720,"Ġvac":3721,"Ġtemperature":3722,"Ġweek":3723,"abb":3724,"Ġthus":3725,"***":3726,"su":3727,"Have":3728,"Ġnone":3729,"Ġleave":3730,"dis":3731,"}`":3732,"ardless":3733,"Ġerror":3734,"HE":3735,"Ġeating":3736,"Ġorange":3737,"ĠkeyName":3738,"yes":3739,"Ġdenomin":3740,"Ġpaths":3741,"ailing":3742,"mtv":3743,"Ġorders":3744,"Ġknown":3745,"eter":3746,"Ġhorizontally":3747,"Ġdogs":3748,"Ġoverlap":3749,"zan":3750,"Ġlakes":3751,"Ġhero":3752,"Ġbitwise":3753,"othes":3754,"Ġavailable":3755,"ĠOriginal":3756,"only":3757,"Ġpost":3758,"ccessor":3759,"Ġschool":3760,"Ġturned":3761,"Ġhorizontal":3762,"ĠCAPS":3763,"Ġmatches":3764,"Ġgift":3765,"Ġguess":3766,"Ġselected":3767,"Recall":3768,"each":3769,"ules":3770,"Ġborder":3771,"uration":3772,"Ġforming":3773,"]);":3774,"Ġtoday":3775,"img":3776,"Image":3777,"571":3778,"Ġswaps":3779,"Ġtransactions":3780,"Ġserving":3781,"Ġ55":3782,"fected":3783,"ĠSystem":3784,"Ġelim":3785,"ruby":3786,"atin":3787,"Ġspecific":3788,"Ġdislikes":3789,"Pro":3790,"Ġ$-":3791,"Ġbigg":3792,"Ġsentence":3793,"Ġpuzzle":3794,"Ġremains":3795,"Ġminim":3796,"eterm":3797,"ĠDon":3798,"Ġduplicates":3799,"(),":3800,"Ġnothing":3801,"Ġrectangular":3802,"Ġdistances":3803,"Ġattack":3804,"Ġrecommended":3805,"Two":3806,"Ġfruit":3807,"ideos":3808,"Ġlog":3809,"requests":3810,"Ġmoment":3811,"ĠType":3812,"weets":3813,"rectangleQueries":3814,"dog":3815,"achine":3816,"oot":3817,"Ġgave":3818,"Ġ\"\"":3819,"Letters":3820,"nil":3821,"\\,":3822,"Ġloves":3823,"Ġxor":3824,"ĠOR":3825,"cor":3826,"width":3827,"ont":3828,"Ġconf":3829,"ĠDes":3830,"Ġrestaur":3831,"lass":3832,"ested":3833,"Ġiter":3834,"ken":3835,"Ġindexes":3836,"Ġlose":3837,"Ġenjoy":3838,"osh":3839,"umer":3840,"Ġsigned":3841,"size":3842,"ĠRuby":3843,"[]":3844,"Ġsqrt":3845,"Ġfifth":3846,"ĠReg":3847,"Formally":3848,"001":3849,"Ġpackages":3850,"Ġ101":3851,"this":3852,"Ġreplaced":3853,"Ġhappen":3854,"Assume":3855,"arest":3856,"Ġgenerated":3857,"data":3858,"Ġroads":3859,"speed":3860,"total":3861,"Ġgrade":3862,"uff":3863,"place":3864,"Ġarranged":3865,"olog":3866,"core":3867,"........":3868,"sp":3869,"Ġ..":3870,"Bill":3871,"Ġperforming":3872,"def":3873,"Math":3874,"world":3875,"Ġnecessary":3876,"tree":3877,"reverse":3878,"Ġnearest":3879,"JS":3880,"Ġindep":3881,"ron":3882,"ric":3883,"Ġhttps":3884,"Ġpicture":3885,"Ġpaid":3886,"acher":3887,"Ġpainted":3888,".*":3889,"Ġload":3890,"Ġdouble":3891,"Ġmill":3892,"Ġdisc":3893,"99999999":3894,"df":3895,"ev":3896,"Ġperformed":3897,"Ġsegments":3898,"00100":3899,"Ġdivision":3900,"hip":3901,"NA":3902,"quent":3903,"ĠmaxLetters":3904,"âĸ¡":3905,"500":3906,"back":3907,"how":3908,"lu":3909,"urther":3910,"portant":3911,"Code":3912,"How":3913,"sequence":3914,"atures":3915,"sensitive":3916,"Ġmaximize":3917,"road":3918,"ething":3919,"Ġproperties":3920,"Ġmem":3921,"Ġrotations":3922,"Ġmatter":3923,"Ġcomes":3924,"piece":3925,"ears":3926,"Ġproducts":3927,"Ġidea":3928,"Ġinfected":3929,"Ġsatisfying":3930,"nn":3931,"ĠTake":3932,"Hi":3933,"Ġstay":3934,"Ġcoe":3935,"Right":3936,"soci":3937,"Ġ:)":3938,"Ġconstant":3939,"itting":3940,"Child":3941,"Ġparenthes":3942,"Ġgirl":3943,"ape":3944,"ison":3945,"________":3946,"Ġ75":3947,"ĠâĢľ":3948,"}~":3949,"Ġmovement":3950,"ilt":3951,"contiguous":3952,"ĠCat":3953,"Ġreversed":3954,"ug":3955,"Ġlittle":3956,"alindrom":3957,"she":3958,"stand":3959,"ĠTr":3960,"Ġgames":3961,"html":3962,"Ġrequire":3963,"\\_":3964,"Ġreally":3965,