{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"special":true,"content":"<pad>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"<unk>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"<bos>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"<eos>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":null,"pre_tokenizer":{"type":"ByteLevel","add_prefix_space":false,"trim_offsets":true},"post_processor":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":false},"decoder":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":true},"model":{"type":"BPE","dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"vocab":{"<pad>":0,"<unk>":1,"<bos>":2,"<eos>":3,"!":4,"\"":5,"#":6,"$":7,"%":8,"&":9,"'":10,"(":11,")":12,"*":13,"+":14,",":15,"-":16,".":17,"/":18,"0":19,"1":20,"2":21,"3":22,"4":23,"5":24,"6":25,"7":26,"8":27,"9":28,":":29,";":30,"<":31,"=":32,">":33,"?":34,"@":35,"A":36,"B":37,"C":38,"D":39,"E":40,"F":41,"G":42,"H":43,"I":44,"J":45,"K":46,"L":47,"M":48,"N":49,"O":50,"P":51,"Q":52,"R":53,"S":54,"T":55,"U":56,"V":57,"W":58,"X":59,"Y":60,"Z":61,"[":62,"\\":63,"]":64,"^":65,"_":66,"`":67,"a":68,"b":69,"c":70,"d":71,"e":72,"f":73,"g":74,"h":75,"i":76,"j":77,"k":78,"l":79,"m":80,"n":81,"o":82,"p":83,"q":84,"r":85,"s":86,"t":87,"u":88,"v":89,"w":90,"x":91,"y":92,"z":93,"{":94,"|":95,"}":96,"~":97,"¡":98,"¢":99,"£":100,"¤":101,"¥":102,"¦":103,"§":104,"¨":105,"©":106,"ª":107,"«":108,"¬":109,"®":110,"¯":111,"°":112,"±":113,"²":114,"³":115,"´":116,"µ":117,"¶":118,"·":119,"¸":120,"¹":121,"º":122,"»":123,"¼":124,"½":125,"¾":126,"¿":127,"À":128,"Á":129,"Â":130,"Ã":131,"Ä":132,"Å":133,"Æ":134,"Ç":135,"È":136,"É":137,"Ê":138,"Ë":139,"Ì":140,"Í":141,"Î":142,"Ï":143,"Ð":144,"Ñ":145,"Ò":146,"Ó":147,"Ô":148,"Õ":149,"Ö":150,"×":151,"Ø":152,"Ù":153,"Ú":154,"Û":155,"Ü":156,"Ý":157,"Þ":158,"ß":159,"à":160,"á":161,"â":162,"ã":163,"ä":164,"å":165,"æ":166,"ç":167,"è":168,"é":169,"ê":170,"ë":171,"ì":172,"í":173,"î":174,"ï":175,"ð":176,"ñ":177,"ò":178,"ó":179,"ô":180,"õ":181,"ö":182,"÷":183,"ø":184,"ù":185,"ú":186,"û":187,"ü":188,"ý":189,"þ":190,"ÿ":191,"Ā":192,"ā":193,"Ă":194,"ă":195,"Ą":196,"ą":197,"Ć":198,"ć":199,"Ĉ":200,"ĉ":201,"Ċ":202,"ċ":203,"Č":204,"č":205,"Ď":206,"ď":207,"Đ":208,"đ":209,"Ē":210,"ē":211,"Ĕ":212,"ĕ":213,"Ė":214,"ė":215,"Ę":216,"ę":217,"Ě":218,"ě":219,"Ĝ":220,"ĝ":221,"Ğ":222,"ğ":223,"Ġ":224,"ġ":225,"Ģ":226,"ģ":227,"Ĥ":228,"ĥ":229,"Ħ":230,"ħ":231,"Ĩ":232,"ĩ":233,"Ī":234,"ī":235,"Ĭ":236,"ĭ":237,"Į":238,"į":239,"İ":240,"ı":241,"Ĳ":242,"ĳ":243,"Ĵ":244,"ĵ":245,"Ķ":246,"ķ":247,"ĸ":248,"Ĺ":249,"ĺ":250,"Ļ":251,"ļ":252,"Ľ":253,"ľ":254,"Ŀ":255,"ŀ":256,"Ł":257,"ł":258,"Ń":259,"ĠĠ":260,"ĠĠĠĠ":261,"ĠĠĠ":262,"ĠĠĠĠĠĠĠĠ":263,"in":264,"ĠĠĠĠĠĠĠ":265,"Ġ=":266,"Ġr":267,"Ġi":268,"or":269,"Ġin":270,"se":271,"ĠĠĠĠĠĠĠĠĠĠĠ":272,"st":273,"an":274,"le":275,"Ġre":276,"ur":277,"00":278,"):":279,"Ġf":280,"de":281,"Ġif":282,"Ġ1":283,"Ġn":284,"Ġc":285,"ar":286,"tur":287,"turn":288,"er":289,"Ġreturn":290,"ge":291,"on":292,"Ġfor":293,"Ġp":294,"Ġm":295,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":296,"int":297,"um":298,"))":299,"Ġ+":300,"en":301,"def":302,"Ġ-":303,"al":304,"lf":305,"self":306,"Ġs":307,"Ġt":308,"Ġd":309,"Ġ0":310,"el":311,"ut":312,"ange":313,"Ġb":314,"at":315,"len":316,"it":317,"Ġrange":318,"ap":319,"ist":320,"re":321,"Ġl":322,"un":323,"Ġw":324,"ol":325,"Ġa":326,"Ġan":327,"ion":328,"Ġel":329,"])":330,"ot":331,"Ġ'":332,"()":333,"Ġ[":334,"Ġint":335,"Ġ==":336,"ĠĠĠĠĠĠĠĠĊ":337,"Ġdef":338,"Ġ(":339,"Ġ2":340,"oun":341,"he":342,"ax":343,"ue":344,"Ġ#":345,"arr":346,"][":347,"la":348,"ct":349,"Ġself":350,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":351,"Ġelse":352,"end":353,"ss":354,"Ġx":355,"ount":356,"Ġst":357,"ro":358,"put":359,"Ġ+=":360,"ĠĠĠĠĠĠĠĠĠĠĠĠ":361,"Ġlen":362,"0000":363,"rint":364,"mp":365,"app":366,"],":367,"hi":368,"ri":369,"())":370,"ed":371,"ort":372,"Ġj":373,"Ġ<":374,"Ġo":375,"Ġnum":376,"..":377,"Ġand":378,"čĊ":379,"ĠĊ":380,"Ġres":381,"me":382,"Ġ>":383,"append":384,"ĠS":385,"Ġmax":386,"List":387,"ing":388,"Ġ\"":389,"Ġv":390,"Ġk":391,"Ġprint":392,"lass":393,"input":394,"Ġ*":395,"Ġ3":396,"class":397,"num":398,"ul":399,"if":400,"gh":401,"ce":402,"olut":403,"olution":404,"',":405,"Ġ4":406,"is":407,"Ġ->":408,"ow":409,"ĠList":410,"Ġans":411,"ĠSolution":412,"Ġy":413,"==":414,"pl":415,"ode":416,"hile":417,"ent":418,"id":419,"ght":420,"]:":421,"ck":422,"for":423,"11":424,"po":425,"Ġdp":426,"plit":427,"ft":428,"ord":429,"ĠĠĠĠĠĠĠĠĠĠĠĠĊ":430,"Ġwhile":431,"ult":432,"Ġg":433,"ex":434,"split":435,"Ġmin":436,"Ġarr":437,"th":438,"__":439,"Ġcount":440,"ad":441,"one":442,"str":443,"Ġh":444,"all":445,"ĠT":446,"get":447,"().":448,"left":449,"Ġstr":450,"mport":451,"ate":452,"ind":453,"Ġnot":454,"10":455,"((":456,"Ġcur":457,"Ġse":458,"art":459,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":460,"iz":461,")]":462,"Ġthe":463,"lo":464,"ĠĠĠĠĊ":465,"di":466,"ĠA":467,"),":468,"val":469,"Ġof":470,"ay":471,"!=":472,"ve":473,"':":474,"ize":475,"Ġbe":476,"000":477,"Ġ5":478,"list":479,"Ġ8":480,"ĠN":481,"ak":482,"99":483,"Ġsum":484,"Ġco":485,"map":486,"rue":487,"('":488,"Ġ7":489,"ions":490,"ight":491,"//":492,"Ġ%":493,"dex":494,"ĠF":495,"Ġlist":496,"les":497,"Ġq":498,"ch":499,"Ġ[]":500,"33":501,"alse":502,"\",":503,"Ġpo":504,"Ġ6":505,"Ġ{":506,"Ġelif":507,"+=":508,"max":509,"ext":510,"ber":511,"mo":512,")):":513,"20":514,"Ġ:":515,"Ġor":516,"count":517,"40":518,"es":519,"Ġnums":520,"Ġ_":521,"27":522,"Ġe":523,"47":524,"13":525,"23":526,"ey":527,"rom":528,"am":529,"Ġwall":530,"up":531,"ĠFalse":532,"gth":533,"Ġis":534,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":535,"sum":536,"ter":537,"ans":538,"ame":539,"ĠTrue":540,"17":541,"Ġdi":542,"60":543,"Ġ9":544,"57":545,"67":546,"19":547,"49":548,"ath":549,"87":550,"Ġ>=":551,"Ġ<=":552,"Ġ!=":553,"80":554,"[-":555,"Ġ-=":556,"29":557,"43":558,"##":559,"il":560,"59":561,"Ġne":562,"Ġcol":563,"53":564,"69":565,"')":566,"op":567,"Ġimport":568,"size":569,"89":570,"pe":571,"ub":572,"Ġval":573,"63":574,"ack":575,"Ġinput":576,"83":577,"ott":578,"**":579,"ime":580,"]]":581,"ver":582,"Ġbott":583,"(\"":584,"Ġbeer":585,"from":586,"Ġcurr":587,"....":588,"nums":589,"Ġresult":590,"ints":591,"Ġbottles":592,"our":593,"cur":594,"Ġhe":595,"()))":596,"nt":597,"res":598,"ix":599,"Ġcon":600,"min":601,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĊ":602,"print":603,"([":604,"\\\"":605,"rid":606,"per":607,"ab":608,"arget":609,"Ġ10":610,"co":611,"=[":612,"index":613,"emp":614,"act":615,"Ġde":616,"Ġleft":617,"dict":618,"sort":619,"[:":620,"Ġon":621,"reak":622,"50":623,"jo":624,"set":625,"arent":626,"length":627,"add":628,"].":629,"\")":630,"Ġto":631,"as":632,"Ġpre":633,"let":634,"Ġword":635,"start":636,"Ġen":637,"00000":638,"ne":639,"41":640,"us":641,"dp":642,"Ġbreak":643,"Ġright":644,"Ġnode":645,"import":646,"isit":647,"em":648,"21":649,"--":650,"ree":651,"da":652,"ir":653,"bda":654,"ound":655,"qu":656,"Ġbo":657,"Ġit":658,"ctions":659,"51":660,"ãģ":661,"erate":662,"ac":663,")-":664,"Ġfind":665,"Ġset":666,"otal":667,"Ġch":668,"fs":669,"ep":670,"pop":671,"ain":672,"Ġar":673,"umerate":674,"ĠNone":675,"isited":676,"key":677,"join":678,"Ġenumerate":679,"Ġu":680,"81":681,"61":682,"Ġ\"\"":683,"Ġstart":684,"*(":685,"word":686,"Ġnew":687,"od":688,"om":689,"et":690,"right":691,"():":692,"que":693,"im":694,"ĉĉ":695,"Ġcont":696,"lections":697,"ys":698,"]=":699,"and":700,"Ġsort":701,"Ġro":702,"Ġ__":703,"ere":704,"node":705,"idx":706,"Ġ{}":707,"bs":708,"heck":709,"ype":710,"Ġcollections":711,"iff":712,"number":713,"ine":714,"ĠM":715,".\\":716,"\",\"":717,"pos":718,")+":719,"mat":720,"ĠC":721,"Ġvisited":722,"Ġpa":723,"ower":724,"Ġ//":725,"init":726,"ard":727,"]+":728,"]-":729,"Ġtarget":730,"ault":731,"inue":732,"ixel":733,"rt":734,"Ġpixel":735,"Ġpos":736,"root":737,"ĠĠĠĠĠ":738,"letter":739,"to":740,"Ġnumber":741,"Ġend":742,")))":743,"ish":744,"Ġcontinue":745,"Ġz":746,"Ġsorted":747,"24":748,"ase":749,"77":750,"edge":751,"Ġget":752,"find":753,"tr":754,"Ġtemp":755,"bj":756,"loat":757,"Ġtotal":758,"]==":759,"array":760,"26":761,"Ġlo":762,"aultdict":763,"ip":764,"48":765,"ers":766,"rap":767,"__(":768,"ations":769,"ok":770,"Ġmath":771,"Ġkey":772,"ĠD":773,"string":774,"73":775,"ake":776,"Ġroot":777,"Ġabs":778,"Ġ''":779,"Ġone":780,"row":781,"Ġcnt":782,"Ġme":783,"]*":784,"ance":785,"ĠĠĊ":786,"raph":787,"est":788,"der":789,"ast":790,"####":791,"Co":792,"Ġdist":793,"\":":794,"Ġmid":795,"parent":796,"79":797,"inf":798,"gest":799,"Ġth":800,"25":801,"ld":802,"own":803,"Ġhere":804,"Ġ\"\"\"":805,"verse":806,"ore":807,"28":808,"dd":809,"Ġindex":810,"rime":811,"Ġsys":812,"ic":813,"Ġgrid":814,"col":815,"ĠB":816,"]))":817,"ition":818,"ill":819,"Ġdfs":820,"Ġobj":821,"Ġheap":822,"name":823,"dx":824,"Ġpass":825,"value":826,"Ġpro":827,"hild":828,"46":829,"!!":830,"())):":831,"age":832,"Ġpoints":833,"read":834,"]])":835,"Ġyour":836,"30":837,"Ġnext":838,"ors":839,"39":840,"ven":841,"move":842,"[(":843,"ra":844,"line":845,"45":846,"Ġstack":847,"rip":848,"pre":849,"Ġ[[":850,"Ġam":851,"Ġseen":852,"Ġas":853,"Ġstring":854,"curr":855,"lam":856,"lambda":857,"Ġ/":858,"<=":859,":-":860,"Ġun":861,"ith":862,"next":863,"Ġprev":864,"Node":865,"ache":866,"fit":867,"du":868,"70":869,"bo":870,"ĠK":871,"lem":872,"git":873,"ity":874,"15":875,"points":876,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":877,"Ġout":878,"]):":879,"grid":880,"lower":881,"=[]":882,"16":883,"100":884,"pro":885,"44":886,"Ġedge":887,"roup":888,"00000000":889,"Ġdown":890,">=":891,"Ġrow":892,"Ġvalue":893,"din":894,"ounter":895,"In":896,"','":897,"None":898,"Ġmemo":899,"irst":900,"item":901,"Sum":902,"86":903,"ise":904,"pt":905,"ĠL":906,"ig":907,"Ġex":908,"12":909,"Ġque":910,"con":911,"ust":912,"Ġcook":913,"Ġdish":914,"Ġidx":915,"Ġlast":916,"Ġfloat":917,"time":918,"Ġmat":919,"Ġstep":920,"ation":921,"Ġtime":922,"Ġheapq":923,"we":924,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĊ":925,"Ġcurrent":926,"Ġchar":927,"55":928,"37":929,"Ġdefaultdict":930,"Cost":931,"ear":932,"Ġlam":933,"----":934,"Ġbool":935,"Ġ**":936,"Ġlambda":937,"ces":938,"Ġwords":939,"88":940,"Ġsub":941,"old":942,"22":943,"pla":944,"Ġwe":945,"Ġgraph":946,"ect":947,"Take":948,"Ġparent":949,"ating":950,"Ġaround":951,"ib":952,"ive":953,"ank":954,"able":955,"ou":956,"readline":957,"Ġcheck":958,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":959,"ays":960,"ols":961,"ongest":962,"stack":963,"...":964,"ins":965,"Ġqueue":966,"olve":967,"56":968,"lag":969,"Ġall":970,"400":971,"type":972,"Ġmap":973,"Ġret":974,"000000":975,"Ġhi":976,"new":977,"Ġ20":978,"point":979,"alle":980,"of":981,"Sub":982,"nTake":983,"'.":984,")*":985,"ãĤ":986,"[::-":987,"ary":988,"ush":989,"Ġ40":990,"18":991,"char":992,"Ġletter":993,"Ġtr":994,"gs":995,"Ġcost":996,"child":997,"],[":998,"90":999,"rix":1000,"ence":1001,"Ġ'((":1002,"iles":1003,",-":1004,"93":1005,"-=":1006,"Ġlength":1007,"ial":1008,"stdin":1009,"mid":1010,"ĠP":1011,"Ġdiff":1012,"['":1013,"Ġdict":1014,"dist":1015,"0000000":1016,"isect":1017,"Ġ13":1018,"ant":1019,")//":1020,"fix":1021,"Ġname":1022,"Val":1023,"ata":1024,"li":1025,"vel":1026,"pp":1027,"mod":1028,"core":1029,"rie":1030,"OD":1031,"range":1032,"Ġle":1033,"True":1034,"uel":1035,"200":1036,"97":1037,"out":1038,"Ġmod":1039,"are":1040,"elper":1041,"66":1042,"58":1043,"strip":1044,")/":1045,"sub":1046,"Ġtmp":1047,"Ġdic":1048,"req":1049,"ero":1050,"Ġedges":1051,"temp":1052,"abs":1053,"heapp":1054,"words":1055,"Ġflag":1056,"(-":1057,"ery":1058,"Ġfact":1059,"ĠR":1060,"ustom":1061,"Ġpar":1062,"14":1063,"heap":1064,"\",\"....":1065,"ag":1066,"ru":1067,"Ġmo":1068,"loc":1069,"ator":1070,"bin":1071,"Ġlst":1072,"\\\"\\\"":1073,"Po":1074,"duct":1075,"Di":1076,"{}":1077,"____":1078,"Ġsolve":1079,"Ġcom":1080,"lst":1081,"Ġal":1082,"MM":1083,"target":1084,"her":1085,")%":1086,"diff":1087,"ang":1088,"ĠCounter":1089,"Ġsize":1090,"()]":1091,"31":1092,":]":1093,"Ġarray":1094,"Len":1095,"Max":1096,"Name":1097,"71":1098,"Ġdiv":1099,"fact":1100,"Ġprime":1101,"Time":1102,"Ġfirst":1103,"ach":1104,"uf":1105,"68":1106,"Ġreverse":1107,"Ġcan":1108,"imit":1109,"Ġcounter":1110,"ĠI":1111,"']":1112,"cache":1113,"cnt":1114,"digit":1115,"place":1116,"Ġfrom":1117,"ingCost":1118,"Ġlongest":1119,"result":1120,"(*":1121,"ide":1122,"lement":1123,"########":1124,"sorted":1125,"return":1126,"values":1127,"Ġfun":1128,"Ġare":1129,"Of":1130,"ible":1131,"code":1132,"wer":1133,"wo":1134,"while":1135,"Ġqu":1136,"rr":1137,"main":1138,"cost":1139,"inal":1140,"ies":1141,"ren":1142,"ĠĠĠĠĠĠĠĠĠĊ":1143,"''":1144,"keys":1145,"py":1146,"Ġiter":1147,"42":1148,"Ġdeque":1149,"Ġ'(":1150,")',":1151,"ĠY":1152,"800":1153,"Ġ|":1154,"Ġposition":1155,"pa":1156,"Ġadd":1157,"upper":1158,"cd":1159,"110":1160,"zy":1161,"sed":1162,"ustomers":1163,"Num":1164,"cept":1165,"52":1166,"eg":1167,"oll":1168,"items":1169,"ps":1170,"Ġbisect":1171,"format":1172,"ream":1173,"600":1174,"Ġ12":1175,"91":1176,"amp":1177,"text":1178,"Ġitem":1179,"Ġwill":1180,"\"\"":1181,"ait":1182,"Ġ,":1183,"Ġcra":1184,"Ġgroup":1185,"II":1186,"Ġcrazy":1187,"64":1188,"ĠĠĠĠĠĠĠĠĠ":1189,"Ġ&":1190,"rice":1191,"Ġ60":1192,"Ġ80":1193,"ction":1194,"ĠO":1195,"))',":1196,"54":1197,"ä¸":1198,").":1199,"year":1200,"igh":1201,"Ġunion":1202,"Ġboard":1203,"his":1204,"84":1205,"xt":1206,"Ġhead":1207,"St":1208,"reeNode":1209,"Ġpath":1210,"Ġcode":1211,"Ġ[(":1212,"Ġmove":1213,"ite":1214,"rank":1215,"Ġhas":1216,"qrt":1217,")])":1218,"Ġ((":1219,"ated":1220,"replace":1221,"Ġtext":1222,"Ġsm":1223,"ask":1224,"arch":1225,"math":1226,"defaultdict":1227,"reverse":1228,"ph":1229,"numbers":1230,"Ġ)":1231,"Ġzip":1232,"Ġsu":1233,"Check":1234,"ĠSt":1235,"prime":1236,"Ġbin":1237,"Ġprofit":1238,"ĠĠĠĊ":1239,"Ġad":1240,"ĠTreeNode":1241,"65":1242,"Ġpoint":1243,"Ġodd":1244,"Size":1245,"2000":1246,"com":1247,"rtype":1248,"float":1249,"Ġdel":1250,"remove":1251,"Ġamount":1252,"Ġhelper":1253,"Ġsh":1254,"erval":1255,"tools":1256,"par":1257,"ES":1258,"Ġ11":1259,"Ġ''.":1260,"cond":1261,"\".":1262,"False":1263,"Ġage":1264,")==":1265,"]],":1266,"uple":1267,"Ġsteps":1268,"4000":1269,"-(":1270,"unn":1271,"imum":1272,"Ġdo":1273,"ĠĠĠĠĠĠ":1274,"date":1275,"Ġtree":1276,"Checker":1277,"Ġbest":1278,"children":1279,"ef":1280,"Ġwith":1281,"]*(":1282,"lay":1283,"ĠG":1284,"other":1285,"Ġcomp":1286,"alc":1287,"ner":1288,"ment":1289,"XX":1290,"._":1291,"CC":1292,"Ġfuel":1293,"82":1294,"Ġloc":1295,"Ġanswer":1296,"Ġ100":1297,"ighb":1298,"To":1299,"sert":1300,"starting":1301,"ĠU":1302,"ell":1303,"ssible":1304,"day":1305,"Ġop":1306,"ly":1307,"case":1308,"Ġup":1309,"peed":1310,"ood":1311,"ĠW":1312,"Value":1313,"85":1314,"amount":1315,"Ġitertools":1316,"Ġdis":1317,"]+=":1318,"Pro":1319,"prev":1320,"Ġoutput":1321,"total":1322,"ta":1323,"group":1324,"Ġdistance":1325,"ĠMOD":1326,"Ġat":1327,"seq":1328,"Ġ400":1329,"ates":1330,"07":1331,"=(":1332,"Ġ'.":1333,"popleft":1334,"div":1335,"step":1336,"Ġmatrix":1337,"+(":1338,"utes":1339,"reamChecker":1340,"Ġrating":1341,"ie":1342,"ĠStreamChecker":1343,"cc":1344,"]),":1345,"Ġcache":1346,"board":1347,"NO":1348,"!!!!":1349,"Ġind":1350,"graph":1351,"Ġclass":1352,"]>":1353,"tree":1354,"Ġord":1355,"01":1356,"Ġuf":1357,"else":1358,"Count":1359,"09":1360,"03":1361,"Ġnumbers":1362,"Ġ@":1363,"62":1364,"data":1365,"quence":1366,"Ġheapp":1367,"weet":1368,"Ġ<<":1369,"ights":1370,"Ġwait":1371,"--------":1372,"Ġparam":1373,"argest":1374,"Ġtry":1375,"cre":1376,"Ġeven":1377,"Ġthat":1378,"Str":1379,"ĠYour":1380,"32":1381,"Ġscore":1382,"vert":1383,"ci":1384,"Ġdigit":1385,"Ġadj":1386,"====":1387,"!\"":1388,"ðŁ":1389,"parents":1390,"dic":1391,"ĺī":1392,"Ġround":1393,"ðŁĺī":1394,"last":1395,"sys":1396,"Ġprefix":1397,"/(":1398,"]!=":1399,"Ġinst":1400,"Ġmy":1401,"nect":1402,"heappush":1403,"idth":1404,"ĠE":1405,"ns":1406,"Ġmain":1407,"Ġ99":1408,"Ġthis":1409,"profit":1410,"75":1411,"no":1412,"Counter":1413,"onent":1414,"Ġlow":1415,")[":1416,"current":1417,"ave":1418,"ðŁĺīðŁĺī":1419,"Ġ'''":1420,"lock":1421,"ople":1422,"Ġli":1423,"Ġsuch":1424,":])":1425,"sqrt":1426,"position":1427,"8000":1428,"))]":1429,"dfs":1430,"ile":1431,"ng":1432,"Ġpiles":1433,"Ġexcept":1434,"=\"":1435,"Ġby":1436,"cto":1437,"Ġ50":1438,"ï¼":1439,"Ġ['":1440,"path":1441,"),(":1442,"allest":1443,"Ġ19":1444,"Ġoper":1445,"()):":1446,"='":1447,"quare":1448,"red":1449,"Ġcoins":1450,"Ġobject":1451,"union":1452,"matrix":1453,"ma":1454,"alled":1455,"ctools":1456,"ty":1457,"piles":1458,"Ġfreq":1459,"inish":1460,"Ġcalled":1461,")*(":1462,"Ġsolution":1463,"35":1464,"Ġ^":1465,"bit":1466,"first":1467,"eld":1468,"Ġ17":1469,"Ġmem":1470,")}":1471,"owel":1472,"Ġremain":1473,"Ġfactor":1474,"]=='":1475,"anti":1476,"34":1477,"Ġinstanti":1478,"1100":1479,"Ġlevel":1480,"Ġinstantiated":1481,"Ġ30":1482,"duce":1483,"Ġnp":1484,"Ġwh":1485,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":1486,"ute":1487,"ĠX":1488,"ãģ®":1489,"Ġchild":1490,"ĉĉĉ":1491,"Ġ\\\"\\\"":1492,"ded":1493,"Ġtype":1494,"opy":1495,"heappop":1496,"sc":1497,"rect":1498,"resh":1499,"head":1500,"Ġvalid":1501,"YES":1502,"':'":1503,"IN":1504,"cl":1505,"use":1506,"Ġper":1507,"6000":1508,"by":1509,"ĠH":1510,"mon":1511,"Ġany":1512,"Ġremove":1513,"Ġlimit":1514,"Ġrunn":1515,"ervals":1516,"ique":1517,"odd":1518,"ãĥ":1519,"Ġ15":1520,"layer":1521,"},":1522,"Ġno":1523,"Ġ[-":1524,"loor":1525,"'):":1526,"________":1527,"Ġbinary":1528,"Ġcalc":1529,"'s":1530,"pth":1531,"reshold":1532,"rating":1533,"stamp":1534,"locations":1535,"comp":1536,"ick":1537,"Length":1538,"Ġtwo":1539,"Ġbase":1540,"36":1541,"ork":1542,"(\\\"":1543,"Con":1544,"valid":1545,"Ġsecond":1546,"test":1547,"(),":1548,"form":1549,"Ġhigh":1550,"Ġfunctools":1551,"Index":1552,"72":1553,"angle":1554,"check":1555,"ield":1556,"Ch":1557,"order":1558,"trie":1559,"ulate":1560,"ello":1561,"Ġ')":1562,"Ġrec":1563,"Ġlargest":1564,"Points":1565,"110100":1566,"Le":1567,"level":1568,"ump":1569,"Ġpe":1570,"Ġquery":1571,"Ġ*=":1572,"Ġother":1573,"deque":1574,"args":1575,"Ġgcd":1576,"Ġelement":1577,"curs":1578,"Ġcl":1579,"å¯":1580,"ines":1581,"]<":1582,"Ġ18":1583,"ark":1584,"irs":1585,"query":1586,"ink":1587,"No":1588,"erge":1589,"ice":1590,"Ġ16":1591,"Ġ14":1592,"memo":1593,"76":1594,"Ġcustomers":1595,"lru":1596,"cle":1597,"Ġwin":1598,"even":1599,"af":1600,"dis":1601,"Ġcolor":1602,"[:-":1603,"Ġmx":1604,"counter":1605,"Ġeach":1606,"indow":1607,"limit":1608,"Ġtable":1609,"tern":1610,"95":1611,"96":1612,"ong":1613,"Ġtest":1614,"ains":1615,"Ġyear":1616,"Ġseq":1617,"Ġbit":1618,"not":1619,"Ġdata":1620,"Ġ26":1621,"alph":1622,"Ġfl":1623,"\\\",":1624,"imal":1625,"actions":1626,")>":1627,"Diff":1628,"edges":1629,"Ġrank":1630,"pppp":1631,"Re":1632,"Set":1633,"Ġdivis":1634,"price":1635,"Ġ24":1636,"andid":1637,"38":1638,"Ġreduce":1639,"queue":1640,"digits":1641,"io":1642,"che":1643,"Ġcounts":1644,"cy":1645,"tmp":1646,"ont":1647,"000000007":1648,"78":1649,"av":1650,".__":1651,"ign":1652,"74":1653,"Ġcoin":1654,"Ġpow":1655,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĊ":1656,"ob":1657,"lets":1658,"land":1659,"ail":1660,"Ġused":1661,"Ġ(-":1662,"Ġ70":1663,"ls":1664,"Ġprimes":1665,"zero":1666,"Ġ\\\"":1667,"å°":1668,"Ġgo":1669,"factor":1670,"Ġdays":1671,"Ġshort":1672,"Ġ'(((":1673,"nd":1674,"000000000":1675,")))',":1676,"sm":1677,")),":1678,"Subarray":1679,"Number":1680,"kill":1681,"ify":1682,"Ġ200":1683,"])):":1684,"94":1685,"92":1686,"pow":1687,"uff":1688,"icult":1689,"Arr":1690,"loom":1691,"ļĦ":1692,"Ġline":1693,",'":1694,"su":1695,"çļĦ":1696,")**":1697,"Ġfinal":1698,"]]:":1699,"ouse":1700,"score":1701,"ory":1702,"Ġpart":1703,"Ġzero":1704,"ats":1705,"iculty":1706,"Ġfinish":1707,"Ġcap":1708,"tuple":1709,"Ġinit":1710,"ĠrunningCost":1711,"Ġmult":1712,"Ġstate":1713,"<<":1714,"!'":1715,"Err":1716,"card":1717,"Ġso":1718,"iter":1719,"ĠTrie":1720,"################":1721,"Ġfr":1722,"Ġfactors":1723,"Error":1724,"Ġneed":1725,"mi":1726,"table":1727,"Dict":1728,"Ġpossible":1729,"Ġfound":1730,"Ġlocations":1731,"ater":1732,"eam":1733,"sh":1734,"Ġ{'":1735,"98":1736,"Ġbu":1737,"Ġneighb":1738,"product":1739,":[":1740,"iv":1741,"search":1742,"copy":1743,"customers":1744,"cap":1745,"low":1746,"Map":1747,"ĠminCost":1748,"Ġsearch":1749,"ts":1750,"visited":1751,"Se":1752,"with":1753,"Ġstop":1754,"gr":1755,"Ġoperator":1756,"Ġroll":1757,"log":1758,"1000":1759,"Ġtot":1760,"Ġ\")":1761,"Ġ90":1762,"Ġls":1763,"MOD":1764,"Comp":1765,"Ġ23":1766,"Ġprice":1767,"Ġarea":1768,"box":1769,");":1770,"older":1771,"distance":1772,"ens":1773,"Ġcase":1774,"`.":1775,"Ġ]":1776,"Ġheight":1777,"eger":1778,"ale":1779,"ones":1780,"Ġnon":1781,"Ġstdin":1782,"123":1783,"fuel":1784,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĊ":1785,"]][":1786,"gen":1787,"Profit":1788,"binations":1789,"ry":1790,"Âł":1791,"={}":1792,"]%":1793,"ĠQ":1794,"Ġ}":1795,"203":1796,"Ġhash":1797,"Ġneg":1798,"=='":1799,"coins":1800,"Oper":1801,"ceil":1802,"hift":1803,"inition":1804,"ĠDef":1805,"Ġnxt":1806,"action":1807,"ash":1808,"åĪ":1809,"url":1810,"211":1811,"ĠĠĠĠĠĠĠĠĠĠ":1812,"æľ":1813,"anag":1814,"attern":1815,"tri":1816,"cess":1817,"Operations":1818,"Day":1819,"gcd":1820,"ĠDefinition":1821,"be":1822,"sequence":1823,"arg":1824,"]].":1825,"ï¼Į":1826,"dout":1827,"quar":1828,"Ġdigits":1829,"fun":1830,"steps":1831,"ĠboardingCost":1832,"freq":1833,"Ġpeople":1834,"erence":1835,"Ġmoves":1836,"obj":1837,"Ġhave":1838,"Un":1839,"yp":1840,"ĠčĊ":1841,"insert":1842,"Ġproduct":1843,"inst":1844,"wap":1845,"trans":1846,"][-":1847,"119":1848,"Ġver":1849,"Ġ800":1850,"Ġpower":1851,"Ġback":1852,"Ġ\\\"\\\"\\\"":1853,"409":1854,"ser":1855,"ull":1856,"))+":1857,"state":1858,"play":1859,"qual":1860,"Ġyield":1861,"ke":1862,"Ġev":1863,"iginal":1864,"Ġorder":1865,"Ġheappush":1866,"ose":1867,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":1868,"Dist":1869,"Ġ4000":1870,"Ġdire":1871,"Ġ1000":1872,"Word":1873,"ipl":1874,"'''":1875,"'],":1876,"Ġacc":1877,"Ġ25":1878,"Ġvalues":1879,"helper":1880,"ms":1881,"ãĤĭ":1882,"ved":1883,"Ġtrans":1884,"loomDay":1885,"ices":1886,"Ġ//=":1887,"ll":1888,"20000":1889,"ds":1890,"inp":1891,"do":1892,"ĠĠĠĠĠĊ":1893,"eries":1894,"Ġsmallest":1895,"bisect":1896,"Path":1897,"my":1898,"Ġshortest":1899,"Ġthan":1900,"si":1901,"Ġ\"\".":1902,"so":1903,"instance":1904,"Ġbox":1905,"Ġ4020":1906,"pace":1907,"wr":1908,"âĸ":1909,"ative":1910,"ian":1911,"Ġsc":1912,"part":1913,"Ġwaiting":1914,"'))":1915,"Ġ240":1916,"Ġ'+":1917,"Not":1918,"Ġ\\":1919,"333":1920,"609":1921,"Ġ'\\":1922,"111":1923,"nodes":1924,"stop":1925,"Ġ2000":1926,"400000":1927,"ĠminOperations":1928,"Ġnodes":1929,"113":1930,"abet":1931,"mn":1932,"Ġav":1933,"Ġ[],":1934,"Ġnow":1935,"Ġmi":1936,"Ġ48":1937,"mut":1938,"207":1939,"fter":1940,"Ġsums":1941,"Th":1942,"ource":1943,"ruit":1944,"Ġ480":1945,"Ġpy":1946,"Ġmerge":1947,"alind":1948,"101":1949,"ĠUn":1950,".....":1951,"area":1952,"divis":1953,"40000":1954,"Ġ%=":1955,"weight":1956,"Ġsol":1957,"now":1958,"rome":1959,"quest":1960,"Connect":1961,"Ġma":1962,"(''.":1963,"Ġread":1964,"Ġcard":1965,"element":1966,"Ġwindow":1967,"Ġreversed":1968,"riplets":1969,"Ġrem":1970,"city":1971,"Min":1972,"Ġday":1973,"9999":1974,"alindrome":1975,")+'":1976,"mu":1977,"Ġcity":1978,"Ġmake":1979,"years":1980,"anager":1981,"mult":1982,"([(":1983,"Ġchange":1984,"ĠmaxSum":1985,"Ġce":1986,"593":1987,"Ġ21":1988,"stacks":1989,"Ġ27":1990,"139":1991,"acity":1992,"Ġmask":1993,"Ġhand":1994,"......":1995,"MMM":1996,"ild":1997,"height":1998,"`.`.":1999,"tt":2000,"Ġ29":2001,"extend":2002,"Ġ('":2003,"Pos":2004,"')]":2005,"\",\".":2006,"Ġexp":2007,"rices":2008,"verage":2009,"LI":2010,"Bo":2011,"\"\"\"":2012,"ĠĠĠĠĠĠĠĠĠĠĠĠĠ":2013,"primes":2014,"Ġbfs":2015,"Div":2016,"zz":2017,"Ġceil":2018,"ows":2019,"693":2020,"color":2021,"alls":2022,"Ġ8040":2023,"sets":2024,"Ġisinstance":2025,"279":2026,"117":2027,"])-":2028,"500":2029,"son":2030,"Ġemp":2031,"293":2032,"Ġheappop":2033,"339":2034,"uts":2035,"Ġtuple":2036,"abc":2037,"object":2038,"Hello":2039,"ĠĠĠĠĠĠĊ":2040,"Ġ\".":2041,"807":2042,"491":2043,"273":2044,"recurs":2045,"sums":2046,"lab":2047,"579":2048,"neg":2049,"prefix":2050,"403":2051,"local":2052,"ĠUnion":2053,"Ġvert":2054,"603":2055,"andom":2056,"factors":2057,"quares":2058,"'{":2059,"Ġmp":2060,"ious":2061,"Ġ33":2062,"mask":2063,"499":2064,"umps":2065,"473":2066,"åĲ":2067,"=-":2068,"ST":2069,"Ġlower":2070,"ĠminCostConnect":2071,"best":2072,"ress":2073,"Ġintervals":2074,"base":2075,"floor":2076,"Ġnumpy":2077,"ĠminCostConnectPoints":2078,"80000":2079,"Ġsame":2080,"tweet":2081,"\\\")":2082,"bu":2083,"letters":2084,"239":2085,"========":2086,"two":2087,"131":2088,"539":2089,"137":2090,"Ġmore":2091,"573":2092,"337":2093,"$$":2094,"Ġwork":2095,"191":2096,"Ġinitial":2097,"Find":2098,"sTo":2099,"ãĢ":2100,"owels":2101,"high":2102,"ele":2103,"lose":2104,"ssage":2105,"Ġelem":2106,"493":2107,"Ġtimes":2108,"lice":2109,"speed":2110,"ĠV":2111,"atest":2112,"æķ":2113,"alpha":2114,"Difficulty":2115,"('-":2116,"days":2117,"691":2118,"SE":2119,"Ġ97":2120,"173":2121,"mx":2122,"Ġcy":2123,"III":2124,"rem":2125,"Ġ37":2126,"ced":2127,"ĠĠĠĠĠĠĠĊ":2128,"ii":2129,"109":2130,"\"],[":2131,":]:":2132,"Ġplayer":2133,"maxsize":2134,"Ġthreshold":2135,"ðŁĺīðŁĺīðŁĺīðŁĺī":2136,"...\",\"....":2137,"match":2138,"**(":2139,"sp":2140,"ho":2141,"Ġsplit":2142,"Ġdepth":2143,"200000":2144,"Ġ',":2145,"Ġgr":2146,"297":2147,"Ġsp":2148,"Ġdx":2149,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":2150,"ãĤĴ":2151,"447":2152,"Ġweight":2153,"sec":2154,"879":2155,"407":2156,"179":2157,"Ġtop":2158,"209":2159,"mem":2160,"reet":2161,"Game":2162,"zip":2163,"Mo":2164,"atis":2165,"])+":2166,"679":2167,"Ġrepe":2168,"Ġwidth":2169,"193":2170,"FS":2171,"ai":2172,"dge":2173,"331":2174,"xy":2175,"rea":2176,"Ġcandid":2177,"Ġblock":2178,"Ġlook":2179,"ours":2180,"atus":2181,"åı":2182,"\"]":2183,"String":2184,"alth":2185,"673":2186,"'t":2187,"dy":2188,"Ġinp":2189,"ret":2190,"497":2191,"873":2192,"439":2193,"Ġuse":2194,"237":2195,"Yes":2196,"Ġyou":2197,"839":2198,"solve":2199,"Ġmaximum":2200,"607":2201,"MA":2202,"Ġstone":2203,"893":2204,"cont":2205,"\"{":2206,"]}":2207,"][:":2208,"197":2209,"sent":2210,"171":2211,"quen":2212,"width":2213,"631":2214,"591":2215,"ending":2216,":'":2217,"671":2218,"Ġparents":2219,"rstrip":2220,"Ġnc":2221,"871":2222,"Ġthen":2223,"cs":2224,"401":2225,"597":2226,"639":2227,"=[[":2228,"277":2229,"437":2230,"He":2231,"103":2232,"291":2233,"Step":2234,"cii":2235,"271":2236,"ranks":2237,"Ġnonlocal":2238,"æķ°":2239,"hand":2240,"jk":2241,"hes":2242,"Ġ39":2243,"apping":2244,"ĠnumT":2245,"411":2246,"ital":2247,"ER":2248,"iven":2249,"Ġ36":2250,"479":2251,"803":2252,"431":2253,"counts":2254,"cum":2255,"107":2256,"ici":2257,"Ġinf":2258,"itions":2259,"Ġ[[]":2260,"IT":2261,"Ġcum":2262,"Ġ22":2263,"809":2264,"Ġdec":2265,"Ġdelta":2266,"Array":2267,"])]":2268,"Let":2269,"mula":2270,"na":2271,"xs":2272,"Ġ59":2273,"formTime":2274,"%(":2275,"Ġdy":2276,"Ġele":2277,"Ġvis":2278,"Ġrows":2279,"weights":2280,"Ġcombinations":2281,"umn":2282,"qr":2283,"Ġkeys":2284,"ee":2285,"993":2286,"Ġupdate":2287,"Ġrot":2288,"Ġalph":2289,"]<=":2290,"999":2291,"477":2292,"677":2293,"Ġletters":2294,"837":2295,"ãģ«":2296,"Ġ800000":2297,"write":2298,"537":2299,"831":2300,"\"],[\"":2301,"pu":2302,"177":2303,"Ġ47":2304,"OR":2305,"637":2306,"'),":2307,"neighb":2308,"Ġ120":2309,"ĠListNode":2310,"531":2311,"571":2312,"Ġ43":2313,"891":2314,"503":2315,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":2316,"os":2317,"seen":2318,"skill":2319,"orrect":2320,"Ġnei":2321,"Ġgroups":2322,"recursion":2323,"507":2324,"Ġformula":2325,"Ġ[\"":2326,"Ġ89":2327,"----------------":2328,"231":2329,"mul":2330,"Ġtimestamp":2331,"110010":2332,"Area":2333,"remain":2334,"Ġ32":2335,"471":2336,"697":2337,"110100110010":2338,"ivot":2339,"inner":2340,"Ġ'-":2341,"577":2342,"11010010":2343,"Ġspeed":2344,"Ġ31":2345,"uld":2346,"ages":2347,"))))":2348,"ĠNode":2349,"most":2350,"877":2351,"cm":2352,"ÂłÂł":2353,"herit":2354,"Ġincre":2355,"Ġpairs":2356,"Ġsequence":2357,"ilter":2358,"lete":2359,"Or":2360,"509":2361,"Ġsi":2362,"\",\"...":2363,"Ġmaxi":2364,"Ġtra":2365,"Ġopt":2366,"02":2367,"\",\"..":2368,":],":2369,"lis":2370,"your":2371,"depth":2372,"Ġnb":2373,"Ġtyp":2374,"201":2375,"Ġresults":2376,"You":2377,"997":2378,"Ġ79":2379,"XXX":2380,"Ġsquare":2381,"adj":2382,"intervals":2383,"Ġlog":2384,"vers":2385,"flag":2386,"897":2387,"Ġpr":2388,"riend":2389,"try":2390,"ä»":2391,"Ġ49":2392,"Ġroutes":2393,"Ġsqrt":2394,"Ġ75":2395,"uffer":2396,"fl":2397,"recursionlimit":2398,"CL":2399,"....\",\"....":2400,"________________":2401,"alf":2402,"Ġss":2403,",(":2404,"Ġdsu":2405,"ID":2406,"round":2407,"ĠIf":2408,"ĠUnionFind":2409,"Ġ53":2410,"quests":2411,"heritance":2412,"strng":2413,"Ġ57":2414,"rec":2415,"nei":2416,"Ġ83":2417,"answer":2418,"Ġrecord":2419,"Ġra":2420,"433":2421,"fset":2422,"mark":2423,"Ġunique":2424,"'}":2425,"lines":2426,"With":2427,"roll":2428,"stdout":2429,"Ġ>>":2430,"vals":2431,"eff":2432,"Ġflip":2433,"ĠDP":2434,"Distance":2435,"Ġmon":2436,"Ġ63":2437,"60000":2438,"uffix":2439,"Ġcalculate":2440,"the":2441,"ical":2442,"Ġprevious":2443,"nr":2444,"Ġminimum":2445,"longest":2446,"thon":2447,"801":2448,"any":2449,"Ġ1000000007":2450,"DCC":2451,"ture":2452,"Ġ69":2453,"ars":2454,"Ġkn":2455,"Ġ28":2456,"Ġcomb":2457,"Ar":2458,"pr":2459,"Ġgood":2460,"Days":2461,"oper":2462,"Idx":2463,"501":2464,"Ġsubarray":2465,"ei":2466,"wait":2467,"Ġlis":2468,"ĠIn":2469,"chars":2470,"Ġside":2471,"601":2472,"NS":2473,"ward":2474,"Ġ73":2475,"except":2476,"Ġeval":2477,"second":2478,".\"":2479,"king":2480,"('\\":2481,"233":2482,"raction":2483,"Ġold":2484,")+(":2485,"att":2486,"457":2487,"update":2488,"setrecursionlimit":2489,"rows":2490,"213":2491,"top":2492,"Ġ67":2493,"').":2494,"Ġones":2495,"å¤":2496,"Ġcell":2497,"Ġshift":2498,"late":2499,"Ġmn":2500,"eams":2501,"Ġstore":2502,"600000":2503,"blem":2504,"sol":2505,"Ġpx":2506,"Ġxs":2507,"800000":2508,"!!!!!!!!":2509,"func":2510,"hr":2511,"px":2512,"Ġbus":2513,"pi":2514,"Ġ400000":2515,"\"):":2516,"))*":2517,"CD":2518,"isdigit":2519,"Ġrandom":2520,"Inheritance":2521,"Per":2522,"ĉĉĉĉ":2523,"ĠMA":2524,"Seq":2525,"rans":2526,"Ġpu":2527,"power":2528,"è¿":2529,"ents":2530,"nxt":2531,"Ġturn":2532,"Ġgen":2533,"Ġ93":2534,"The":2535,"afe":2536,"enter":2537,"]>=":2538,"Ġtri":2539,"come":2540,"991":2541,"Ġfloor":2542,"chr":2543,")[::-":2544,"240":2545,"Ġmul":2546,"reate":2547,"())))":2548,"factorial":2549,"Letter":2550,"Ġtrip":2551,"Ġoriginal":2552,"rc":2553,"Ġfactorial":2554,")<":2555,"469":2556,"Ġpattern":2557,"Ġ86":2558,"Ġprod":2559,"Ġhow":2560,"Ġ##":2561,"1000000007":2562,"419":2563,"ptr":2564,"ĠTime":2565,"Ġtrie":2566,"oot":2567,"track":2568,"ĠinformTime":2569,"]-=":2570,"Change":2571,"Ġempty":2572,"ä¸ª":2573,"Ġ35":2574,"bus":2575,"oth":2576,"={":2577,"eval":2578,"ied":2579,"Ġ40000":2580,"Ġ77":2581,"Ġ'#":2582,"exp":2583,"Prime":2584,"Ġopen":2585,"[:]":2586,"IO":2587,"ier":2588,"Ġinvalid":2589,"Ġonly":2590,"449":2591,"Ġjob":2592,"Ġ38":2593,"isalpha":2594,"Ġpop":2595,"Ġpair":2596,":(":2597,"np":2598,"Ġ96":2599,"hash":2600,"Ġ'*":2601,"ãģĦ":2602,"0000000000":2603,"ĠRe":2604,"Counts":2605,"Ġdivisor":2606,"æĺ":2607,"Ġlru":2608,"people":2609,"Ġweights":2610,"[\"":2611,"ek":2612,"Ġcat":2613,"asing":2614,"Ġ|=":2615,"487":2616,"lex":2617,"Ġnth":2618,"Ġdate":2619,"://":2620,"inct":2621,"prod":2622,"Subseq":2623,"Ġdifference":2624,"Ġpointer":2625,"Product":2626,"åħ":2627,"seven":2628,"Ġinv":2629,"]==\"":2630,")/(":2631,"cell":2632,"istory":2633,"wh":2634,"Ġ(\"":2635,"229":2636,"Ġfunction":2637,"Ġwinner":2638,"cat":2639,"Ġapp":2640,"Ġgreet":2641,"Ġstrng":2642,"Left":2643,"side":2644,"ä½":2645,"job":2646,"249":2647,"bloomDay":2648,"dle":2649,"Box":2650,"Rout":2651,"Ġ\",":2652,"611":2653,"Ġpla":2654,"itive":2655,"227":2656,"223":2657,"ym":2658,"Ġcols":2659,"ets":2660,"Edge":2661,"å±":2662,"])%":2663,"Ġflower":2664,"Ġbl":2665,"ionary":2666,"erson":2667,"eded":2668,"Ġcopy":2669,"ĠTrieNode":2670,"217":2671,"ings":2672,"pppppppp":2673,"player":2674,"moves":2675,"Int":2676,"Ġthere":2677,"lect":2678,"811":2679,"fr":2680,"))%":2681,"Ġ):":2682,"Component":2683,"427":2684,"463":2685,"Tree":2686,"Ġjump":2687,"Ġconnect":2688,"down":2689,"Ġdone":2690,"Ġargs":2691,"Ġmatch":2692,"259":2693,"Ġ87":2694,"Nodes":2695,"tail":2696,"Ġct":2697,"Ġid":2698,"({":2699,")!=":2700,"og":2701,"Player":2702,"Ġjo":2703,"Ġ600000":2704,"Ġchr":2705,"hour":2706,"Ġ55":2707,"489":2708,"Ġbr":2709,"Ġ88":2710,"Ġlookup":2711,"eiou":2712,"Qu":2713,"Range":2714,"nx":2715,"Ġbuild":2716,":\"":2717,"Ġurl":2718,"fa":2719,"ff":2720,"Ġab":2721,"Ġisland":2722,"icient":2723,"ca":2724,"uv":2725,"ĠfindL":2726,"Ġdirection":2727,"))-":2728,"Ġvisit":2729,"dr":2730,"ny":2731,"italize":2732,"aeiou":2733,"æľĢ":2734,"dec":2735,"del":2736,"verl":2737,"LE":2738,"back":2739,"Ġcoord":2740,"ould":2741,"Ġvar":2742,"Ġ65":2743,"480":2744,"eep":2745,"Ġtail":2746,"ĠgetMax":2747,"Ġchars":2748,"267":2749,"pq":2750,"Ġbet":2751,"ĠrollMax":2752,"Order":2753,"sz":2754,"xx":2755,"+=(":2756,"Stack":2757,"ched":2758,"IM":2759,"buffer":2760,"==\"":2761,"Ġ58":2762,"'])":2763,"219":2764,"Ġ^=":2765,"Substring":2766,"Ġ46":2767,"Ġgiven":2768,"Valid":2769,"})":2770,"ĠnumOf":2771,"loy":2772,"247":2773,"483":2774,"bir":2775,"gold":2776,"))/":2777,"05":2778,"......\",\"....":2779,"Ġpl":2780,"Ġms":2781,"Ġcharact":2782,"300":2783,"417":2784,"ots":2785,"Ġloop":2786,"ieve":2787,"299":2788,"243":2789,"269":2790,"oriz":2791,"Ġtake":2792,"uble":2793,"default":2794,"453":2795,"ally":2796,"ä¸Ģ":2797,"ire":2798,"requen":2799,"fore":2800,"gre":2801,"Ġfolder":2802,"Ġhouse":2803,"Ġneighbor":2804,"467":2805,"ores":2806,"lean":2807,"_,":2808,"Ġpi":2809,"Ġok":2810,"263":2811,"Rect":2812,"als":2813,"];":2814,"aa":2815,"var":2816,"Ġremaining":2817,"Numbers":2818,"IS":2819,"Ġbound":2820,"Ġ45":2821,"Ġknight":2822,"Speed":2823,"mass":2824,"rs":2825,"Ġsing":2826,"257":2827,"bound":2828,"åŃ":2829,"Ġstatus":2830,"timestamp":2831,"iply":2832,"Divis":2833,"413":2834,"aler":2835,"mutations":2836,"Ġ56":2837,"Ġnr":2838,"itres":2839,"Ġ76":2840,"ather":2841,"unk":2842,"routes":2843,"Ġcapacity":2844,"287":2845,"([])":2846,"SU":2847,"()),":2848,"ready":2849,"Ġdd":2850,"100000":2851,"bal":2852,"ww":2853,"Target":2854,"Ġ66":2855,"uper":2856,"losest":2857,"calc":2858,"æĸ":2859,"Routes":2860,"-((":2861,"te":2862,"Ġ68":2863,".......\",\"....":2864,"Unique":2865,"ons":2866,"Ġptr":2867,"])==":2868,"Ġ41":2869,"findall":2870,"429":2871,"mm":2872,"Ġ_,":2873,"æĺ¯":2874,"423":2875,"513":2876,"Ġcand":2877,"plic":2878,"253":2879,"ĠFraction":2880,"smallest":2881,"Arith":2882,"283":2883,"443":2884,"ding":2885,"ĠĠĠĠčĊ":2886,"ãģ§":2887,"00000000000":2888,"511":2889,")\",":2890,"coin":2891,"ze":2892,"Ġrequests":2893,"))):":2894,"459":2895,"elem":2896,"Ġupper":2897,"ween":2898,"4000000":2899,"lack":2900,"Ġ98":2901,")-(":2902,"ĠcoinChange":2903,"*-":2904,"xyz":2905,")],":2906,"block":2907,"Ġcc":2908,"Ġ61":2909,"Ġcho":2910,"Ġneighbors":2911,"Ġalphabet":2912,"swith":2913,"åĢ":2914,"coord":2915,"Ġcycle":2916,"10000":2917,"Gold":2918,"ram":2919,"candid":2920,"490":2921,"AT":2922,"Ġ95":2923,"289":2924,"Ġ200000":2925,"ĠlongestArith":2926,"Letters":2927,"uman":2928,"atestStep":2929,"ual":2930,"arry":2931,"edian":2932,"ĠlongestArithSeq":2933,"633":2934,"::":2935,"=''":2936,"ĠminArea":2937,"dered":2938,"Move":2939,"Square":2940,"Ġprices":2941,"raw":2942,"used":2943,"ĠlongestArithSeqLength":2944,"Ġ...":2945,"Ġmanager":2946,"Ġswap":2947,"ĠfindLatestStep":2948,"241":2949,"inv":2950,"hest":2951,"Ġgre":2952,"ssion":2953,"dices":2954,"533":2955,"Child":2956,"Ġcreate":2957,"Ġob":2958,"Ġ\"+":2959,"Ġinterval":2960,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĊ":2961,"813":2962,"ghi":2963,"square":2964,"wxyz":2965,"Ġpivot":2966,"Ġmark":2967,"ses":2968,"Dialer":2969,"587":2970,"yes":2971,"integer":2972,"ttps":2973,"break":2974,"go":2975,"ĠcountRoutes":2976,"])))":2977,"Ġrev":2978,"Ġ{\"":2979,")]:":2980,"833":2981,"è¦":2982,"Ġsource":2983,"Ġds":2984,"amage":2985,"Ġroute":2986,":]))":2987,"four":2988,"çĤ":2989,"Ġpq":2990,"abcdef":2991,"qrst":2992,"collections":2993,"bl":2994,"Ġelements":2995,"ĉĊ":2996,"Ġus":2997,"Ġconvert":2998,"stream":2999,"anced":3000,"+'":3001,"Ġxor":3002,"Ġsumm":3003,"230":3004,"pair":3005,"Score":3006,"work":3007,"othes":3008,"MaxProfit":3009,"ways":3010,"elif":3011,"reversed":3012,"481":3013,"Com":3014,"Ġlines":3015,"message":3016,"thod":3017,"change":3018,"ĠminOperationsMaxProfit":3019,"skills":3020,"Ġ.":3021,"peak":3022,"]]=":3023,"lable":3024,"441":3025,"Ġbig":3026,"Ġinteger":3027,"island":3028,"clu":3029,"Ġbits":3030,"406":3031,"äº":3032,"Ġinsert":3033,"ments":3034,"460":3035,"(((":3036,"pec":3037,"Ġzeros":3038,"ape":3039,"cols":3040,"Ġ20400":3041,"Ġfunc":3042,"groups":3043,"ination":3044,"270":3045,"filter":3046,"Ġå":3047,"Ġrun":3048,"ãģ¨":3049,"589":3050,"oc":3051,"4567":3052,"Ġremainder":3053,"jkl":3054,"can":3055,"ec":3056,"Ġreach":3057,"Ġalice":3058,"çĤ¹":3059,"inc":3060,"ulator":3061,"190":3062,"Ġrepeat":3063,"ĠknightDialer":3064,"gree":3065,"003":3066,"Ġext":3067,"Ġ78":3068,"ĠPro":3069,"neighbor":3070,"567":3071,"xor":3072,"Ġsq":3073,"inter":3074,"Ġdivmod":3075,"ote":3076,"Ġ\"(":3077,"170":3078,"bers":3079,"jobs":3080,"Ġnames":3081,"requency":3082,"md":3083,"ĠThe":3084,"Ġ71":3085,"faction":3086,"comb":3087,"atisfaction":3088,"Good":3089,"ror":3090,"ĠendTime":3091,"Ġchildren":3092,"547":3093,"ular":3094,"208":3095,"Ġperson":3096,"Ġsl":3097,"indices":3098,"ority":3099,"Ġ91":3100,"times":3101,"angu":3102,"599":3103,"codes":3104,"uvwxyz":3105,",\"":3106,"251":3107,"aller":3108,"utive":3109,"iple":3110,"tweetName":3111,"824":3112,"Ġny":3113,"Ġdivide":3114,"At":3115,"ĠnumR":3116,"ãģª":3117,"ãģĮ":3118,"alphabet":3119,"583":3120,"nc":3121,"rot":3122,"orm":3123,"Ġskill":3124,"Ġmini":3125,"setdefault":3126,"ĠUF":3127,"tot":3128,"Ġcorrect":3129,"output":3130,"*((":3131,"ni":3132,"ssing":3133,"person":3134,"zzle":3135,"secutive":3136,"][::-":3137,"anies":3138,"very":3139,"529":3140,"647":3141,"=\"\"":3142,"ghest":3143,"Ġdq":3144,"abel":3145,"Coins":3146,"543":3147,">>":3148,"By":3149,"549":3150,"Ġdivisors":3151,".....\",\"....":3152,"Fact":3153,"Ne":3154,"uck":3155,"{:":3156,"seg":3157,"Ġplay":3158,"ities":3159,"bits":3160,",[":3161,"559":3162,"!!\"":3163,"280":3164,"410":3165,"til":3166,"557":3167,"519":3168,"umns":3169,"890":3170,"ãģ¦":3171,"INF":3172,"gram":3173,"MAX":3174,"613":3175,"Root":3176,"Ġac":3177,"acc":3178,"average":3179,"Ġbeg":3180,"261":3181,"Ġ51":3182,"221":3183,"rop":3184,"ascii":3185,"687":3186,"Ġsign":3187,"Ġgame":3188,"chain":3189,"2000000":3190,"527":3191,"far":3192,"oned":3193,"517":3194,"Right":3195,"hello":3196,"Ġ'',":3197,"ĠmaxSize":3198,"mand":3199,"Ġdictionary":3200,"den":3201,"Ġseg":3202,"Ġmost":3203,"Ġspace":3204,"690":3205,"ĠDSU":3206,"699":3207,"numer":3208,"=\"\")":3209,"ailable":3210,"461":3211,"CM":3212,"heapify":3213,"binary":3214,"Ġsep":3215,"joint":3216,"440":3217,"End":3218,"Id":3219,"Ġvowels":3220,"Ġ8000":3221,"619":3222,"}\"":3223,"Ġii":3224,"Ġinter":3225,"Ġchain":3226,"jklmn":3227,"Bit":3228,"solution":3229,"ĠbloomDay":3230,"563":3231,"700":3232,"Ġrecur":3233,"ueue":3234,"Ġ\"((":3235,"Ġbob":3236,"Ġinc":3237,"Ġsuffix":3238,"Ġafter":3239,"Ġkeep":3240,"Ġcolumn":3241,"ãĢģ":3242,"ample":3243,"ĠEx":3244,"ĠarrLen":3245,"weetCounts":3246,"uc":3247,"ĠĠĠĠĠĠĠĠĠĠĠĊ":3248,"ops":3249,"]**":3250,"Ġinto":3251,"Ġfront":3252,"281":3253,"finish":3254,"290":3255,"boardingCost":3256,"819":3257,"Case":3258,"final":3259,"dies":3260,"Ġcolors":3261,"rectangle":3262,"ux":3263,"Ġ\"\\":3264,"130":3265,"ough":3266,"br":3267,"txt":3268,"ç»":3269,"health":3270,"Ġmean":3271,"good":3272,"kom":3273,"pute":3274,"330":3275,"zeros":3276,"shift":3277,"stone":3278,"rib":3279,"Remove":3280,")<=":3281,"451":3282,"ON":3283,"('.":3284,"ĠFind":3285,"ĠstartTime":3286,"Ġtrack":3287,"ĠTimeMap":3288,"659":3289,"kes":3290,"source":3291,"Ġfa":3292,"))//":3293,"20000000":3294,"Triplets":3295,"Zero":3296,"maxi":3297,"ĠminAreaRect":3298,"ken":3299,"Ġtak":3300,"Threshold":3301,"899":3302,"863":3303,"Ġbill":3304,"Ġwon":3305,"ĠValue":3306,"ComponentSize":3307,"663":3308,"EN":3309,"drink":3310,"AC":3311,"Sim":3312,"manager":3313,"Ġballs":3314,"dice":3315,"Ġ81":3316,"Ġcosts":3317,"ustomer":3318,"}{":3319,"Ġ100000":3320,"450":3321,"523":3322,"869":3323,"It":3324,"fill":3325,"appy":3326,"Ġgold":3327,"ãģĻ":3328,"+((":3329,"553":3330,"569":3331,"657":3332,"649":3333,"Ġoffset":3334,"names":3335,"Ġqueries":3336,"Ġdiscount":3337,"ĠlargestComponentSize":3338,"Ġclothes":3339,"DP":3340,"Ġact":3341,"stra":3342,"260":3343,"ume":3344,"umpy":3345,"pression":3346,"jklmnop":3347,"829":3348,"here":3349,"original":3350,"Ġdr":3351,"Ġlabel":3352,"Ġvowel":3353,"Ġhour":3354,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":3355,"Ġdogs":3356,"Ġitems":3357,"orizont":3358,"ghijklmnop":3359,"843":3360,"CX":3361,"non":3362,"Ġwas":3363,"Ġstdout":3364,"artition":3365,"739":3366,"################################":3367,"823":3368,"hich":3369,"izz":3370,"Ġvals":3371,"common":3372,"617":3373,"Ġreq":3374,"Ġfe":3375,"Ġsuper":3376,"rade":3377,"(?":3378,"moved":3379,"roots":3380,"(_":3381,"Freq":3382,"Sp":3383,"link":3384,"Ġfac":3385,"****":3386,"Ġpref":3387,"Subarrays":3388,"OU":3389,"pattern":3390,"palindrome":3391,"hick":3392,"vered":3393,"marks":3394,"qrstuvwxyz":3395,"001":3396,"Ġcandidates":3397,"'*":3398,"AL":3399,"Ġpv":3400,"Ġsw":3401,"verlap":3402,"421":3403,"kip":3404,"007":3405,"ries":3406,"avor":3407,"883":3408,"AB":3409,"fin":3410,"nown":3411,"Ġwr":3412,"oly":3413,"pairs":3414,"627":3415,"667":3416,"vl":3417,"Ġover":3418,"Ġequal":3419,"orizontal":3420,"gg":3421,"ĠValueError":3422,"849":3423,"859":3424,"Ġnx":3425,"sq":3426,"Ġfight":3427,"()[":3428,"ghijklmnopqrstuvwxyz":3429,"Ġwhere":3430,"jobDifficulty":3431,"Ġindices":3432,"Digit":3433,"Ġtyping":3434,"Ġæ":3435,"bination":3436,"\"))":3437,"itch":3438,"Ġbetween":3439,"ev":3440,"430":3441,"Ġ4008":3442,"Ġtransactions":3443,"stoneValue":3444,"Ġfull":3445,"dire":3446,"793":3447,"797":3448,"Ġconnected":3449,"delta":3450,"Ġstarting":3451,"avorite":3452,"(\\":3453,"merge":3454,"Ġpick":3455,"470":3456,"Boxes":3457,"867":3458,"Sort":3459,"arcodes":3460,"Ġter":3461,"isupper":3462,"ĠIN":3463,"Ġcandidate":3464,"Ġjobs":3465,"icket":3466,"================":3467,"ped":3468,"Ġ10000":3469,"Ġwhich":3470,"Ġden":3471,"birth":3472,"'\\":3473,"541":3474,"889":3475,"One":3476,"rev":3477,"Ġ[])":3478,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":3479,"Ġthree":3480,"ĠstoneGame":3481,"ader":3482,"pv":3483,"ĠminDays":3484,"\":\"":3485,"Ġages":3486,"Ġexponent":3487,"40000000":3488,"oneInheritance":3489,"(\"\".":3490,"efficient":3491,"669":3492,"Ways":3493,"Ġ'/":3494,"heep":3495,"Ġdatetime":3496,"853":3497,"wise":3498,"Ġ\"-":3499,"cho":3500,"abcdefghijklmnopqrstuvwxyz":3501,"887":3502,"runn":3503,"qui":3504,"ĠfindThe":3505,"681":3506,"827":3507,"ien":3508,"alanced":3509,"Ġhours":3510,"ĠThr":3511,"childName":3512,"Ġsmall":3513,"Ġpermutations":3514,"ĠThroneInheritance":3515,"817":3516,"RE":3517,"Ġpalindrome":3518,"Ġdirections":3519,"521":3520,"900":3521,"ome":3522,"leet":3523,"Ġfill":3524,"ĠmaxProfit":3525,"773":3526,"Ġdistinct":3527,"results":3528,"643":3529,"Ġtweet":3530,"capacity":3531,"Companies":3532,"Ġ`":3533,"ĠmaxDistance":3534,"Ġalready":3535,"avoriteCompanies":3536,"uplic":3537,"hip":3538,"ĠmaxNum":3539,"strings":3540,"Ġrect":3541,"\").":3542,"Ġmessage":3543,"Subsequence":3544,"ĠdistanceThreshold":3545,"creasing":3546,"translate":3547,"[]":3548,"683":3549,"Ġ>>=":3550,"Ġ2010":3551,".'":3552,"Ġaccum":3553,"3000":3554,"For":3555,"VI":3556,"}'.":3557,"Ġways":3558,"Ġmaxx":3559,"olume":3560,"open":3561,"Ġencode":3562,"1100110100110010":3563,"110011010010":3564,"ãĢĤ":3565,"110011010010110100110010":3566,"841":3567,"Ġ40800":3568,"Ġbacktrack":3569,"Ġwins":3570,"IV":3571,"870":3572,"Equal":3573,"Fib":3574,"largest":3575,"lices":3576,"Ġblocked":3577,"beg":3578,"swap":3579,"Ġenough":3580,"ãģĭ":3581,"Ġps":3582,"Ġlong":3583,"cases":3584,")>=":3585,"881":3586,"Ġ123":3587,"551":3588,"623":3589,"history":3590,"mak":3591,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":3592,"737":3593,"`.`.`.`.":3594,"Jumps":3595,"Ġaa":3596,"Ġ{(":3597,"779":3598,"709":3599,"Ġraise":3600,"847":3601,"Ġfriend":3602,"aper":3603,"ips":3604,"pointer":3605,"è¦ģ":3606,"Longest":3607,"Ġfruit":3608,")).":3609,"Ġsquares":3610,"Ġposs":3611,"needed":3612,"ðŁĺīðŁĺīðŁĺīðŁĺīðŁĺīðŁĺīðŁĺīðŁĺī":3613,"waiting":3614,"/((":3615,"581":3616,"ki":3617,"Ġbut":3618,"appendleft":3619,"Ġdesc":3620,"689":3621,"857":3622,"Ġ;":3623,"repe":3624,"()])":3625,"791":3626,"sired":3627,"851":3628,"All":3629,"ssign":3630,"ĠmaxLetters":3631,"Ġevery":3632,"777":3633,"ĠnumTriplets":3634,"Pa":3635,"ĠĠĠĠĠĠĠĠĠĠĊ":3636,"mation":3637,"combinations":3638,"ĠstoneValue":3639,"Heap":3640,"Cuts":3641,"Ġlcm":3642,"Ġops":3643,"After":3644,"IX":3645,"folder":3646,"lowercase":3647,"Height":3648,"ĠProduct":3649,"AR":3650,"dent":3651,"Ġcs":3652,"Ġinteg":3653,"On":3654,")].":3655,"perm":3656,"Ġshould":3657,"Ġbir":3658,"startswith":3659,"man":3660,"Ġcarry":3661,"itle":3662,"arrays":3663,"Ġuni":3664,"Ġsimp":3665,"]//":3666,"win":3667,"ĠminSize":3668,"Ġcond":3669,"*=":3670,"ugh":3671,"oney":3672,"ject":3673,"rand":3674,"Ġpush":3675,"stops":3676,"Kth":3677,"Ġfin":3678,"ãģ¯":3679,"393":3680,"Ġless":3681,"641":3682,"Ġcommand":3683,"Ġsieve":3684,"Common":3685,"balls":3686,"}'":3687,"Ġll":3688,"possible":3689,"Ġglo":3690,"Ġtraverse":3691,"'+":3692,"629":3693,"jump":3694,"........\",\"....":3695,"Words":3696,"Two":3697,"olean":3698,"inates":3699,"Ġrest":3700,"Possible":3701,"water":3702,"Ġpp":3703,"Ġbi":3704,"==-":3705,"OfNumbers":3706,"ä»¥":3707,"pecial":3708,"Ġbegin":3709,"black":3710,"sign":3711,"}:":3712,"Ġreplace":3713,"alice":3714,"rees":3715,"Ġ20000":3716,"Ġ80000":3717,"\\\",\\\"":3718,"Ġ20048":3719,"stac":3720,"530":3721,"Ġending":3722,"Ans":3723,"VII":3724,"VIII":3725,"Ġassert":3726,"Ġexist":3727,"likes":3728,"661":3729,":]):":3730,"fruit":3731,"Ġns":3732,"unique":3733,"Ġgroupby":3734,"Ġwhen":3735,"Ġhouses":3736,"(',":3737,"861":3738,"game":3739,"åĩ":3740,"009":3741,"mutation":3742,"prices":3743,"ãģĹ":3744,"731":3745,"5000":3746,"Ġ117":3747,"Ġhttps":3748,"sizes":3749,"Level":3750,"Ġascii":3751,"Ġcomponent":3752,"kingName":3753,"ĠReturn":3754,"ĠProductOfNumbers":3755,"FF":3756,"fac":3757,"oo":3758,"ored":3759,"islower":3760,"etrans":3761,"vertex":3762,"Ġfractions":3763,"rd":3764,"ure":3765,"Ġmapping":3766,"Ġdif":3767,"4353":3768,"startTime":3769,"oks":3770,"æľī":3771,"push":3772,"aps":3773,"ther":3774,"Ġits":3775,"ĠnumTeams":3776,"anguage":3777,"AN":3778,"rains":3779,"ĠDFS":3780,"Ġcommon":3781,"åĪ°":3782,"220":3783,"Wel":3784,"present":3785,"Ġcompare":3786,"section":3787,"onus":3788,"Ġsz":3789,"ained":3790,"half":3791,"Ġlitres":3792,"Ġ'')":3793,"Ġbefore":3794,"........":3795,"products":3796,"maketrans":3797,"Key":3798,"Ġdiag":3799,"quired":3800,"Ġ130":3801,"Ġmultiply":3802,"651":3803,"Queue":3804,"Ġsome":3805,"ĠMAX":3806,"561":3807,"father":3808,"}\".":3809,"Ġrecurs":3810,"problem":3811,"Ġevent":3812,"atisf":3813,"operator":3814,"210":3815,"Ġ127":3816,"])*":3817,"Ġdest":3818,"Char":3819,"Ġusing":3820,"From":3821,"oid":3822,"Ġmedian":3823,"Ġdie":3824,"Ġpartition":3825,"divisor":3826,"653":3827,"gor":3828,"dest":3829,"Ġ{},":3830,"ĠWe":3831,"ches":3832,"Ex":3833,"Even":3834,"Split":3835,"sl":3836,"Ġri":3837,"initial":3838,"âĸĳ":3839,"elements":3840,"Ġplace":3841,"1000000":3842,"Ġabo":3843,"Ġmiddle":3844,"Ġmm":3845,"Chain":3846,"Ġang":3847,"Ġhalf":3848,"570":3849,"Ġroots":3850,"nb":3851,"åī":3852,")]=":3853,"ĠlongestSubarray":3854,"ĠYou":3855,"capitalize":3856,"ĠshortestPath":3857,"aj":3858,"hs":3859,"ĠJ":3860,"Ġ111":3861,"Ġcut":3862,"Ġcharacter":3863,"Gre":3864,"Ġnn":3865,"rough":3866,"830":3867,"(\"\\":3868,"sa":3869,"vowels":3870,"590":3871,"cover":3872,"Ġavg":3873,"Ġ113":3874,"arm":3875,"ollow":3876,"Ġnegative":3877,"cessor":3878,"Ġdir":3879,"ridge":3880,"Ġ'#'":3881,"Mon":3882,"æī":3883,"Ġimp":3884,"Ġdoes":3885,"divide":3886,"Ġ270":3887,"Ġ101":3888,"621":3889,"City":3890,"NA":3891,"Ġarg":3892,"charact":3893,"Ġvalidate":3894,"Odd":3895,"au":3896,"arge":3897,"opt":3898,"Ġhealth":3899,"negative":3900,"store":3901,"cket":3902,"448":3903,"Pre":3904,"az":3905,"squares":3906,"Ġ')))":3907,"pts":3908,"Ġ20004000":3909,"Ġman":3910,"Ġdc":3911,"stru":3912,"empty":3913,"Ġadjac":3914,"Ġmemory":3915,"served":3916,"________________________________":3917,"Ġfast":3918,"Ġ110":3919,"Ġsent":3920,"670":3921,"Ġheapify":3922,"Ġpri":3923,"Ġbou":3924,"Ġmpg":3925,"direction":3926,"'[":3927,"Bob":3928,"Table":3929,"ĥ½":3930,"ency":3931,"Ġsa":3932,"]='":3933,"+[":3934,"Group":3935,"Element":3936,"Ġindexes":3937,"Ġodds":3938,"rollMax":3939,"OO":3940,"Row":3941,"Ġdt":3942,"8060":3943,"ants":3944,"ĠlongestStr":3945,"Ġour":3946,"Ġhex":3947,"Ġpresum":3948,"Ġsmaller":3949,"Ġcloned":3950,"640":3951,"821":3952,"GH":3953,"visit":3954,"Ġ129":3955,"Ġnj":3956,"Ġcall":3957,"sToRemove":3958,"456789":3959,"eq":3960,"title":3961,"Ġ133":3962,"alary":3963,"Ġthrough":3964,"imumGold":3965,"mouse":3966,"irc":3967,"tra":3968,"ãĤī":3969,"ĠIt":3970,"divisors":3971,"420":3972,"car":3973,"Ġcuts":3974,"its":3975,"Ġxx":3976,"EdgesToRemove":3977,"De":3978,"çĽ":3979,"led":3980,"iples":3981,"Ġrunning":3982,"ĠmaxNumEdgesToRemove":3983,"Ġln":3984,"ues":3985,"Ġdesired":3986,"ollsTo":3987,"Ġmonth":3988,"ollsToTarget":3989,"window":3990,"Ġer":3991,"))])":3992,"Ġminutes":3993,"630":3994,"off":3995,"linked":3996,"\"\\":3997,"424":3998,"6000000":3999,"æł":4000,"ĠThis":4001,"nomin":4002,"tw":4003,"åĬ":4004,"Ġrains":4005,"Ġbul":4006,"Ġhighest":4007,"ĠlongestStrChain":4008,"dif":4009,"Ġ2000000":4010,"road":4011,"difference":4012,"Ġdislikes":4013,"Ġobstac":4014,"begin":4015,"ature":4016,"Ġcmd":4017,"accum":4018,"ĠgetMaximumGold":4019,"Pl":4020,"cr":4021,"five":4022,"Ġ###":4023,"][(":4024,"Ġpositive":4025,"']:":4026,"åº":4027,"stones":4028,"Ġfile":4029,"Ġni":4030,"bob":4031,"ãĤĮ":4032,"big":4033,"stat":4034,"irror":4035,"column":4036,"Ġincrement":4037,"nn":4038,"Ġ[[-":4039,"Ġ40000000":4040,"info":4041,"divisible":4042,"space":4043,"Ġjust":4044,"ulo":4045,"Ġgap":4046,"Names":4047,"ä¸į":4048,"Ġcomplex":4049,"een":4050,"ful":4051,"397":4052,"='')":4053,"Ġavailable":4054,"Ġchoose":4055,"Ġfib":4056,"Ġgenerate":4057,"ĠnumRollsToTarget":4058,"10000000":4059,"EF":4060,"light":4061,"Ġlet":4062,"Ġban":4063,"threshold":4064,"ables":4065,"åĪĨ":4066,"white":4067,")[-":4068,"men":4069,"Ġticket":4070,"707":4071,"ĠheadID":4072,"Ġpython":4073,"\"),":4074,"cand":4075,"éĢ":4076,"Ġmouse":4077,"getter":4078,"ization":4079,"391":4080,"371":4081,"Ġlocal":4082,"Alice":4083,"è¾":4084,"Ġaux":4085,"Ġ/=":4086,"connect":4087,"Ġyears":4088,"span":4089,"ymb":4090,"->":4091,"bi":4092,"gain":4093,"å®":4094,"703":4095,"Ġpaths":4096,"Ġwho":4097,"Ġtrips":4098,"Col":4099,"hat":4100,"atch":4101,"Ġsec":4102,".......":4103,"quets":4104,"triang":4105,"arger":4106,"jj":4107,"ility":4108,"(['":4109,